{
	"code": 1,
	"data": {
		"date": "2014/10/31",
		"posts": [{
			"picture": "http://fortunedotcom.files.wordpress.com/2013/01/121221115052-147372583.jpg?w=840&h=485&crop=1",
			"tags": ["career", "google"],
			"id": 518,
			"readable_article": "<html><body><div><div class=\"entry-content\">\n\t\t\t\t\t\t\t\t<p>When Google announced that it had built a Web browser on Labor Day in 2008, the event represented something of a coming out party for Sundar Pichai, a little-known and soft-spoken middle manager at the company. Based on how the launch went, no one would have predicted that six years later, Pichai would be where is today—a clear No. 2 to CEO Larry Page following a management shakeup late last week.</p>\n<p>Indeed, the launch of the Chrome browser was something of a debacle. Google <span class=\"tickershortcode quotecard_hook unprocessed neutral\" data-symbol=\"GOOG\">\n\t\t\t\t<span class=\"wrapper trend-wrapper\">\n\t\t\t\t\t<a class=\"exit_trigger_set\" href=\"/company/goog/\">\n\t\t\t\t\t\t<span class=\"ticker\">GOOG</span>\n\t\t\t\t\t\t<span class=\"change percent\"/>\n\t\t\t\t\t</a>\n\t\t\t\t</span>\n\t\t\t</span> had worked hard behind the scenes to orchestrate a media splash. It had readied talking points to explain why it was reigniting a browser war with Microsoft <span class=\"tickershortcode quotecard_hook unprocessed neutral\" data-symbol=\"MSFT\">\n\t\t\t\t<span class=\"wrapper trend-wrapper\">\n\t\t\t\t\t<a class=\"exit_trigger_set\" href=\"/company/msft/\">\n\t\t\t\t\t\t<span class=\"ticker\">MSFT</span>\n\t\t\t\t\t\t<span class=\"change percent\"/>\n\t\t\t\t\t</a>\n\t\t\t\t</span>\n\t\t\t</span>, and why its erstwhile ally, Mozilla, maker of the Firefox browser, shouldn’t worry. As part of it, the company had secretly produced an elaborate, 38-page comic book that explained the unique features of Google’s browser. It was expected to land in the mailboxes of journalists and bloggers on that Tuesday just as they returned from the three-day weekend.</p>\n<p>But the comic books arrived in Germany on Monday, and it was not a holiday there. After a German blogger posted the comic book online, the Chrome team had to scramble to handle the fiasco. Top executives, including Pichai’s boss at the time, Marissa Mayer, were summoned to the Googleplex. After quick but spirited debate, the team decided to move up the announcement by a day. As engineers scrambled to make Chrome available for download from Google’s network of data centers, public relations staff started to alert reporters—most of whom where on holiday—one by one.</p>\n<p>Embarrassing as it was, the snafu was quickly forgotten. Chrome, which launched amid skepticism that it could make inroads against the dominant browsers of the time, Internet Explorer and Firefox, became a runaway hit. It is now the No. 1 browser in the world, with a market share that’s more than twice that of the once dominant Internet Explorer, according to StatCounter. Its success paved the way for a series of related <a href=\"http://fortune.com/2014/04/10/the-dawn-of-the-chrome-age/\">strategically important products</a> including Chrome OS, Chromebooks, and Chromecast. And it became the engine that powered Pichai through one of the fastest corporate ascents in the technology industry.</p>\n<p>Inside Google, however, Pichai had already made his mark as a director of product management for an obscure but important weapon in the company’s arsenal: the Google toolbar. The toolbar was critical because it helped Google make its search engine the default option on IE and Firefox. And Pichai’s role in leading the product as it came under attack from Microsoft, helped cement his standing in the company, as detailed in a <em>Fortune</em> story titled <a href=\"http://fortune.com/2014/04/10/the-dawn-of-the-chrome-age/\">The Dawn of the Chrome Age</a> earlier this year:</p>\n<blockquote><p>Chrome had another, less public mission: to defend the search engine that accounts for most of Google’s $59.8 billion in 2013 revenues and $12.9 billion in profits. Since 2000, Google had distributed a browser toolbar that made its search engine the default on IE and Firefox. (The toolbar also allowed Google to track users’ surfing habits.)</p>\n<p>The toolbar — as geeky and benign as it sounds — was a key locus of Google’s combat with Microsoft. Pichai was the group’s leader, and by the mid-aughts he worried that Microsoft would modify IE to make it more difficult, or even impossible, for users to install the toolbar. In a series of sometimes tense conversations with top brass around the time of a major update to IE in October 2006, Pichai argued that Microsoft could threaten a sizable chunk of Google’s business, according to two executives who were there. “It was a doomsday-like scenario,” one of the executives says. Shortly after, Google execs gave Chrome the green light.</p></blockquote>\n<p>After the launch of Chrome, Pichai was promoted to vice president and later to senior vice president. He was given oversight for Google’s apps, including Gmail, and became a member of the exclusive L-team, the small group of executives who report directly to Page. And when Android creator Andy Rubin left to begin a secret robotics project within Google, Page put Pichai in charge of Android as well.</p>\n<p>With his latest promotion, which is meant to allow Page to focus on longer term issues and on pushing products forward without the overhead of having too many direct reports, Pichai will now also oversee products like search, maps, Google+, commerce, ad products and infrastructure. That’s the vast majority of Google’s enterprise, with the exception of YouTube and other semi-independent units like Nest, Google X, and Calico. Just six years ago, he was one of dozens of mid-level Googlers with the title of director of product management.</p>\n<p>Pichai, 42, is a native of the southern Indian state of Tamil Nadu. He attended university in India before obtaining a graduate degree in engineering and materials science at Stanford. He earned an MBA at the Wharton School and worked at McKinsey and Applied Materials before joining Google in 2004. He is universally well-liked at Google, where he seems to enjoy a “<a href=\"http://fortune.com/2013/03/14/larry-page-shuffles-management-product-groups-at-google/\">warm, easygoing rapport</a>” with Page, as well as outside the company. When news of his latest promotion to head all of Google’s products came out last week, venture capitalist Om Malik, a former blogger, tweeted what was in the mind of many: “Proof nice guys can win.”</p>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div></body></html>",
			"url_domain": "fortune.com",
			"slug": "2014-10-30-google-rise-of-sundar-pichai",
			"title": "Sundar Pichai 火箭般的晋升之路",
			"url": "http://fortune.com/2014/10/27/google-rise-of-sundar-pichai/",
			"readable_title": "The incredibly fast rise of Google's Sundar Pichai",
			"created_at": 1414712755000,
			"summary": "Sundar Pichai 是 2004 年加入 google 的。10年后，一人之下，万人之上（Google 有 55,000 人）。看完这篇文章后，觉得在大公司里，做对的 project 真的很关键。另一个感觉是，有点像 \"太阁立志传\" 。。。",
			"content": "Sundar Pichai 是 2004 年加入 google 的。10年后，一人之下，万人之上（<a href=\"https://investor.google.com/financial/tables.html\" target=\"_blank\">Google 有 55,000 人</a>）。看完这篇文章后，觉得在大公司里，做对的 project 真的很关键。另一个感觉是，有点像 \"<a href=\"http://baike.baidu.com/subview/148725/5074436.htm\" target=\"_blank\">太阁立志传</a>\" 。。。",
			"issue_id": 430
		}],
		"number": 87
	}
}
