{
	"code": 1,
	"data": {
		"date": "",
		"oldest_timestamp": 1434822933329,
		"tag": "apple",
		"posts": [{
			"picture": "http://searchengineland.com/figz/wp-content/seloads/2015/07/How-Apple-Search-Works.png",
			"tags": ["app", "apple", "ios", "search", "trend"],
			"id": 1554,
			"readable_article": "<html><body><div><div itemprop=\"articleBody\" class=\"body-content\">\r\n\t\t\t\t\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t<p><img class=\"aligncenter size-large wp-image-204017\" src=\"http://searchengineland.com/figz/wp-content/seloads/2014/09/social-media-mobile-apps-ss-1920-800x450.jpg\" alt=\"social-media-mobile-apps-ss-1920\" width=\"800\" height=\"450\"/></p>\r\n<p>Every year in June, <a href=\"http://marketingland.com/big-news-apples-event-today-tv-macbook-watches-aplenty-120814\">Apple</a> and <a href=\"http://marketingland.com/google-io-keynote-130243\">Google</a> hold conferences to announce their latest technology. With each announcement, both companies seem to be reaffirming their larger company goals and values — Apple asserting its commitment to designing and selling quality products, and Google bolstering its mission to collect and organize the world’s data with the ultimate intent of monetizing the results with advertising.</p>\r\n<p>These goals resurface through many of the company’s business decisions, most recently through the divergent app indexing frameworks promoted by the two companies. For a long time, deep app content has been locked in app code, largely un-indexed and inaccessible to search engine crawlers. The only content that crawlers could get was app titles and descriptions from the various app stores, and from company websites.</p>\r\n<p>Now that both Apple and Google have announced methods for indexing deep content within apps, the situation has dramatically and irreversibly changed. For those interested in the most cutting-edge digital marketing strategies, the concept of SEO will have to expand to include optimization of deep app content for inclusion in the Apple and Google indexes.</p>\r\n<p>Apple’s overall focus on “products” positions the company to gain the most from a primarily app-based world. In Apple’s ideal scenario, the web is only used as an invisible layer that links apps together and allows apps to become their own uniquely-controlled display-layers for private and public content.</p>\r\n<p>Conversely, Google stands to gain the most from a web-based world where data can be most easily collected, organized, and distributed so Google can become the presentation layer of the Internet. While apps are part of their data collection strategy, Google has invested heavily in <a href=\"https://www.google.com/webdesigner/\" target=\"_blank\">programs</a> that allow developers to create HTML5 web content to rival apps and thus return users to a web-based ecosystem.</p>\r\n<p>This article is the first in a three-part series about new strategies and opportunities for app indexing in Apple, Google, and other ecosystems.</p>\r\n<p>This first article focuses on the ways in which Apple’s new Search API for <a href=\"https://developer.apple.com/library/prerelease/ios/releasenotes/General/WhatsNewIniOS/Articles/iOS9.html\" target=\"_blank\">iOS 9</a> encourages and incentivizes an app-centric digital ecosystem and what that means for marketers looking to surface deep app content for Apple users. This is a comprehensive guide of what you as an SEO need to know about Apple’s foray into search engineering, what it means for your company’s app strategy, how it impacts your company’s SEO strategy, and how to take advantage of these new opportunities to surface your company’s app and website in Apple Search.</p>\r\n<p>The subsequent articles in the series will focus on Google’s app indexing opportunities and the associated strategies, and on future app indexing challenges we will face with the growth wearables and other non-standard device apps and device indexes.</p>\r\n<h2>What Is Apple Search &amp; Why Does It Matter For SEO?</h2>\r\n<p>If you want to surface your app content for iOS users, Apple Search could become a key part of your SEO strategy. Like Google, Apple Search relies on an index (or more accurately, multiple indices) to organize the set of app screens that can be ranked in a search result. Apple refers to their indexes and the software that interfaces with those indexes collectively as “Apple Search.”</p>\r\n<p>Indexed app screens can be surfaced by executing a search in Spotlight or Siri, or through a Spotlight Suggest result that appears when a user types in a query in the address bar of Safari (before hitting “enter”). This means that a user can start a search on Safari and end up being directed to a deep link <em>without ever seeing a single Google result</em> — even where Google is the “default” search engine.</p>\r\n<p>To accomplish this, Apple has introduced the concept of public and private indexing, and three methods for iOS developers to get their app screens indexed for Apple Search: NSUserActivity, CoreSpotlight, and Web Markup.</p>\r\n<p>Despite being limited to iOS app indexing (sorry Android buddies, your apps can’t play here), Apple’s new Search and indexing framework will be an important traffic channel, especially for Apple users who sometimes bypass Google’s algorithms entirely. Unlike Google, Apple has come up with two indexing methods that <em>do not</em> require corresponding web pages to drive app indexing:</p>\r\n<h3><strong>1. NSUserActivity Indexing</strong></h3>\r\n<p>In this indexing method, Apple indexes “user activities,” which you can think of as a sort of “bookmark + JsessionID + cookie” snapshot of a app screen, complete with the navigational understanding of how a user got there and how they have interacted with that screen in the past. Apple calls these snapshots “NSUserActivities,” and they can be indexed by Apple when a developer adds search eligibility markup to the app’s code itself (no website needed), and a user accesses a screen with the markup.</p>\r\n<p>Each NSUserActivity can also be associated with a contentAttributeSet which includes relevant meta data like titles, keywords, and descriptions. This information is used to create the appearance of the search result and to help determine rankings. Each NSUserActivity should have a uniqueIdentifier and/or include a URL link to its corresponding web content.</p>\r\n<h3><strong>2. CoreSpotlight Indexing</strong></h3>\r\n<p>The CoreSpotlight API has historically allowed native iOS components like the Calendar and Mail apps to include items in Spotlight search results. This is now being opened up to all apps in the App Store. This indexing method is somewhat analogous to submitting an XML sitemap in SEO, but the index file is submitted with your application manifest, and it is a different, iOS-specific code, created in a file called a “<span>CSSearchableIndex</span>.”</p>\r\n<p>In this indexing method, the app screens to be indexed are called “<span>CSSearchableItem</span>(s),” and each one is associated with a label called a “<span>uniqueIdentifier</span>.” Each <span>CSSearchableItem</span> can be associated with a “<span>CSSerchableItemAttributeSet</span>” that includes relevant metadata like titles, keywords and descriptions. The <span>CSSerchableItemAttributeSet</span> is used to determine algorithmic relevance and populate the search result.</p>\r\n<p>Each <span>CSSearchableItem</span>/<span>uniqueIdentifier</span> combo can also be associated with “<span>domainIdentifier</span>” to help group certain types of app screens in the database, so that they can be added or removed from the <span>CSSearchableIndex</span> as a group. For example, a <span>uniqueIdentifier</span> might be associated with a specific photo screen while a <span>domainIdentifier</span> might indicate all of the photos within an album.</p>\r\n<p>The important thing to note is that NSUserActivity and CoreSpotlight source their search result meta data <em>from code within the apps themselves</em> (not from a website). This means that SEOs need to be more involved in the app development process earlier than ever before in order to ensure that Apple Search optimized title, description, and keyword markup is included in the app at launch (just like you would for a new web page launch back in 1999).</p>\r\n<p>In addition to NSUserActivity and CoreSpotlight, Apple also allows you to get your deep app content indexed using a web crawler and deep link markup, similar to Google. Deep linking is a process in which web markup is used to link web URLs to their corresponding app screens (called URIs), so that a crawler can understand the connection between the URLs and the URIs. This option <em>does</em> require app content to have crawlable corresponding web content:</p>\r\n<h3><strong>3. Web Markup Indexing</strong></h3>\r\n<p>In this indexing method, Apple’s new web-crawler, “Applebot,” indexes app content from the marketing and/or support URLs that are submitted with the app manifest. Applebot can crawl your website and index corresponding app screens based on the following markup protocols:</p>\r\n<ul>\r\n<ul>\r\n<li><a href=\"https://dev.twitter.com/cards/mobile/deep-linking\" target=\"_blank\">Twitter Card Markup</a>: Twitter Card markup can include a protocol to reference deep links to app screens.</li>\r\n<li><a href=\"http://applinks.org/documentation/\">App Links Protocol</a>: App Links is an external deep linking standard that is also used by Facebook and Bing (and works on iOS and Android).</li>\r\n<li><a href=\"https://developer.apple.com/library/ios/documentation/AppleApplications/Reference/SafariWebContent/PromotingAppswithAppBanners/PromotingAppswithAppBanners.html\">Apple’s Smart App Banners</a>: A protocol created by Apple that displays a special Apple banner on websites when they are accessed from iOS devices. The banner either prompts the user to open the app (if installed) or download it from the App Store.</li>\r\n</ul>\r\n</ul>\r\n<p>Additionally, though it won’t help you get new app screens indexed, Applebot can crawl two other protocols, looking for metadata to display in search results:</p>\r\n<ul>\r\n<ul>\r\n<li><a href=\"http://ogp.me/\">Open Graph</a>: Facebook’s protocol that makes web content easier to share. Apple supports the full protocol and if OG tagging is already in place, Applebot can crawl it.</li>\r\n<li><a href=\"http://Schema.org\" target=\"_blank\">Schema.org</a>: An external markup standard widely embraced across the web. Apple Search is launching with limited support, including the following schemas: AggregateRating, Offers, PriceRange, Interaction Count (likes, views, comments), Organization (phone numbers), Recipes, SearchAction (landing page for search), ImageObject and Actions, limited to: dialing a phone number, getting directions, playing audio or video file.</li>\r\n</ul>\r\n</ul>\r\n<p>Web Markup is great for SEOs, because SEOs can enable and control indexing and metadata by adding markup to the website as we are used to doing. iOS app developers need only generate and share the URI deep links with the SEO team. If app URIs are already in place, this can be a very fast and simple implementation that doesn’t require any development resources or an app update.</p>\r\n<p><strong>IMPORTANT REMINDER:</strong> When iOS deep links on a web page are clicked (be it from your web page or even Facebook or Twitter), they initiate an “<span>openURL</span>” command that tells the phone Operating System to switch from the browser to an app — <span>openURL</span> <em>must</em> be enabled in your app code for deep links to open in the app.</p>\r\n<p>Make sure your app can actually open deep links before you include them in your web markup. If you are relying exclusively on the Web Markup method for app indexing, you will still need to make this change to your app and submit the update. It’s a small detail, but an important one.</p>\r\n<h2>How Does Apple Rank Apps In Apple Search?</h2>\r\n<p>In light of an increased global sensitivity to privacy issues (think the “<a href=\"http://searchengineland.com/library/legal/legal-right-to-be-forgotten\">Right to Be Forgotten</a>” in the EU), Apple has begun to focus on privacy concerns as a key differentiator, and selling point for their products and services. Apple’s new app indexing framework showcases a distinct effort to protect users’ personal information by introducing multiple app indexes:</p>\r\n<ul>\r\n<li>A private ‘Device Index,’ which is a personal index that is only accessible by the specific user ID, like a small individualized database for each Apple user</li>\r\n<li>A public ‘Cloud Index,’ which holds content that is accessible from any Apple device through Spotlight, Siri, or Spotlight Suggest in Safari</li>\r\n</ul>\r\n<p>Because of this architecture, developers can (and should) allow a user’s private app screens to be saved to a private Device Index. Private screens in any app, such as direct messages and user dashboards, are now theoretically indexable.</p>\r\n<p><strong>NOTE:</strong> A similar personalized search history is used by Google, but has never been publicly described as a separate “index” or opened up for developer access. Google tested offering ‘desktop search’ years ago, and has recently been experimenting with indexing personal email results from Gmail. We expect this trend to continue and expand for both Google and Apple into the future.</p>\r\n<p>Like Google, Apple has not disclosed the exact details of their search algorithm, but they have described some key ranking factors that should be considered. Many of Apple’s search ranking factors focus on determining how content should rank in a private Device Index vs. the public Cloud Index. SEOs need to be measured and responsible to have a positive impact on rankings because Apple has said that “malicious or poorly considered [app indexing strategy] <em>implementations</em>” will be penalized “<em>or suppressed entirely</em>” (put those black hats away).</p>\r\n<p>A more comprehensive list of Apple Search ranking factors is included below:</p>\r\n<h3><strong>Positive Ranking Factors</strong></h3>\r\n<ul>\r\n<li><strong>App Installation Status.</strong> Is the app is installed on the device? (installed apps seem to get preference)</li>\r\n<li><strong>Personalized App Engagement.</strong> Does the individual engage with the screen in the app? This is based on time spent with result that Apple determines from session analytics.</li>\r\n<li><strong>App Result Click-Through Rate.</strong> Do users frequently click through the search result vs. picking another result or searching again?</li>\r\n<li><strong>Keywords/ Title.</strong> Do keywords from the “keywords” and “title” designations in the app markup match up with the user’s query?</li>\r\n<li><strong>Aggregated Engagement.</strong> How <em>many</em> users engage with the app screen?</li>\r\n<li><strong>Structured Data on Web.</strong> Is structured data correctly implemented?</li>\r\n<li><strong>Canonical App IDs.</strong> Is the same screen associated with one unique ID or URL across multiple indexing methods (NSUserActivity, CoreSpotlight, and Web Markup)?</li>\r\n<li><strong>Strength/Popularity of Web URL.</strong> How popular is the website associated with the app deep links? (Presumably, this is based on Applebot’s crawl.)</li>\r\n</ul>\r\n<h3><strong>Negative Ranking Factors</strong></h3>\r\n<ul>\r\n<li><strong>Low Engagement.</strong> Do very few users engage with the app screen? (engagement determined by session analytics)</li>\r\n<li><strong>Over-Indexing.</strong> Does the app have many screens in the index with low or no engagement?</li>\r\n<li><strong>Returns.</strong> Do users return to search results right after looking at the app?</li>\r\n<li><strong>Keywords Spamming.</strong> Are developers stuffing too many irrelevant keywords into the keyword field?</li>\r\n<li><strong>Interstitials.</strong> Is something covering the content in the app or preventing users from accessing it?</li>\r\n<li><strong>Javascript (web only).</strong> Is Javascript preventing Applebot from crawling your site to find new app deep links?</li>\r\n<li><strong>Low Star Ratings, Low Review Volume, Poor Reviews.</strong> Apple has not explicitly called these negative ranking factors for Apple Search, but they are negative ranking factors for the App Store, so we expect Apple to treat them similarly here.</li>\r\n</ul>\r\n<p>Apple recommends pursuing multiple indexing methods to optimize app visibility, but the overlapping methods will inevitably create duplication across the various indexes. For example, private content could have both a NSUserActivity and CSSearchableItem indexed, and public content could have both a NSUserActivity and a Web Markup deep link indexed.</p>\r\n<p>This is obviously <em>not</em> ideal for controlling Applebot’s efficiency, so Apple <em>strongly</em> recommends associating each NSUserActivity, CSSearchableItem, and Web Markup deep link with the same uniqueIdentifier and/or URL. This is Applebot’s version of a canonical, and it’s so important to Apple that they’ve even made it a ranking factor in the Apple Search algorithm.</p>\r\n<h2>How Do I Decide Which Indexing Option Is Most Strategic For My Company?</h2>\r\n<p>iOS developers can indicate which indexes they think their app content should be included in. Not all app content must be indexed, so the first question your company needs to answer is: Which content should be included in Apples index and which should not?</p>\r\n<p>Then, since not all indexing methods can assign content to both the public and private indexes, ask: Of the content that should be indexed, which content should be publicly accessible, and which content should be private? The answers to these questions will be the beginning of your app indexing plan.</p>\r\n<p>Generating a list of all app screens and their associated NSUserActivities, then mapping out the public or private nature of the content is an organized way to document this process. Once the private or public nature of app content is determined, the appropriate indexing method can be selected to meet those needs. The NSUserActivities and/or the CoreSpotlight indexing methods can both be used to index content that is intended for the private Device Index while NSUserActivities and or Web Markup can both be used to index content that is intended for the public Cloud Index.</p>\r\n<p>SEOs who are used to Google’s somewhat straightforward and open standards for indexing may have a hard time understanding the 3 different ways that app content can be added to Apple’s Search indexes and how those methods interact.</p>\r\n<p>We created the chart below to help — it outlines the basic functions and limitations for each Apple Search indexing method, described in the previous section, so that the comparison becomes clearer:</p>\r\n<p><img class=\"aligncenter size-large wp-image-223889\" src=\"http://searchengineland.com/figz/wp-content/seloads/2015/06/iOS-9-Apple-Search-Indexing-Methods-800x553-800x553.png\" alt=\"iOS-9-Apple-Search-Indexing-Methods-800x553\" width=\"800\" height=\"553\"/></p>\r\n<p><img class=\"has-border aligncenter wp-image-224402 size-full\" src=\"http://searchengineland.com/figz/wp-content/seloads/2015/07/How-Apple-Search-Works.png\" alt=\"How-Apple-Search-Works\" width=\"442\" height=\"798\"/></p>\r\n<p>NSUserActivity is the only indexing method that has the capability to privately <em>and</em> publicly index content. Engagement statistics from the NSUserActivity session analytics are part of the ranking algorithm, so Apple recommends focusing on the NSUserActivity indexing method first.</p>\r\n<p>Developers can indicate whether a NSUserActivity should be privately or publicly indexed. However, Apple doesn’t automatically publicly index NSUserActivities that are marked for public indexing. Apple still indexes the NSUserActivity to the private Device Index first, and later “promotes” it to the public Cloud Index once a certain number of people have accessed it.</p>\r\n<p>One of the most unique aspects of this new framework is when and how specific NSUserActivities can be promoted to the Cloud Index. Apple’s representative didn’t get into the details, so this aspect of the framework may be a bit unclear until launch. Luckily, he did share a diagram that seemed to indicate that each screen within an app can have a variety of NSUserActivities, some privately indexable and some publically indexable. The developer must associate each indexable NSUserActivity with eligibility code: “<span>var eligibleForSearch</span>” (private indexing) and “<span>var eligibleForSearch</span>” + “<span>var eligibleForPublicIndexing</span>” (public indexing).</p>\r\n<p>In most cases, something like a user dashboard screen will have a publicly indexable default NSUserActivity — an ideal public search result for anyone who has never accessed this screen before. User-specific NSUserActivities that represent the non-default status of the screen should only be privately indexable because they are only appropriate for the specific user that triggered them.</p>\r\n<p>Since both default and customized NSUserActivities are associated with the same app screen, anyone who accesses the screen (public and private) generates engagement data to benefit the publicly indexable, default version of the screen. As a result, the default public version of the screen is a stronger candidate for promotion to the public Cloud Index. Furthermore, because engagement metrics are a positive ranking factor, the default public version of the screen will also likely rank better in all searches, regardless of the user’s historical interactions with the app.</p>\r\n<p><img class=\"aligncenter size-full wp-image-223890\" src=\"http://searchengineland.com/figz/wp-content/seloads/2015/06/NSUserActivity-Promoted-to-Cloud-Index.png\" alt=\"NSUserActivity-Promoted-to-Cloud-Index\" width=\"774\" height=\"708\"/></p>\r\n<h2>How Can The Different Apple App Indexing Protocols Be Used Together To Benefit SEO?</h2>\r\n<p>Developers can use the NSUserActivity indexing method alone, but following the Web Markup indexing method in addition to the NSUserActivity indexing method has some <em>significant</em> advantages (that Apple can’t infer from NSUserActivity alone):</p>\r\n<ol>\r\n<li>When Web Markup is in place, deep linked app screens are <em>automatically </em>added to the public Cloud Index. (No waiting for a certain number of users to discover your content before you can cross the Apple NSUserActivity promotion “threshold.”)</li>\r\n<li>When Applebot finds appropriate Web Markup on your site, the web pages can also be added to Apple’s index. A web page may rank in Spotlight Search, instead of the app, if the app is not installed. (<strong>Note:</strong> This means the Web Markup indexing method gives you two chances to rank: app and web. This is a huge competitive advantage because <em>Apple only indexes web pages that have been submitted to iTunes connect or web pages that contain this app deep link markup</em>. Applebot isn’t a roaming crawler like Googlebot.)</li>\r\n<li>“Website Popularity” helps increase your app’s “Relevance Score” in Apple Search, which is a central aspect of the Apple search algorithm.</li>\r\n<li>Structured data from the website is an independent ranking factor in the Apple Search algorithm.</li>\r\n<li><a href=\"https://schema.org/docs/actions.html\" target=\"_blank\">Action Schema</a> from your website can be pulled in to give your app’s search result additional visual elements (#pizzaz) that make it more appealing to users and drive click-through from the search result, another Apple Search ranking factor.</li>\r\n<li><strong>BONUS POINTS:</strong> This gets you halfway to getting your deep links indexed in Google Search as well (this will be discussed at length in the next article in this series).</li>\r\n</ol>\r\n<div id=\"attachment_223892\" class=\"wp-caption aligncenter\"><img class=\"size-full wp-image-223892\" src=\"http://searchengineland.com/figz/wp-content/seloads/2015/06/eventbrite-ad-apple.png\" alt=\"Source: https://developer.apple.com/videos/wwdc/2015/?id=709\" width=\"611\" height=\"890\"/><p class=\"wp-caption-text\">Source: https://developer.apple.com/videos/wwdc/2015/?id=709</p></div>\r\n<p>Deep links and user activities — whether private or public — only show up as results when the app is installed on the user’s device (or has been in the past). When the app is <em>not</em> installed on a user’s device, Apple will show either an App Store result or indexed web content (discovered by Applebot crawling a site’s Web Markup).</p>\r\n<p>When a user gets the website result, Apple is counting on web developers to have implemented Smart App Banners to refer users from the website to the app download page in the App Store. Apple’s Smart App Banners are great for driving downloads from web traffic that approaches the website from a traditional web referral; but if Apple Search’s ultimate goal is to navigate people away from websites and into an app-only digital space, this strategy misses the boat.</p>\r\n<p><strong>NOTE:</strong> This is a notably less direct experience when contrasted with Google. A user without the app installed who taps a Google deep link from a Google search result is immediately delivered to the app download page in Google Play or the iOS App Store.</p>\r\n<p>Apple has previously tested sending these clicks directly to the App Store, but received pushback from users who wanted a website option. While the new solution satisfies those users, it may fail to convert as many searches into app downloads. It’s especially tenuous if users don’t feel compelled to tap on the Smart App Banner or (more likely) if web developers have not enabled the Smart App Banner on their website at all.</p>\r\n<h2>Concluding Remarks</h2>\r\n<p>SEO practitioners must evolve to keep up with the expanding definition of what constitutes “SEO.” With the new iOS 9 app indexing announcement, SEOs also must evolve to work with Apple’s new understanding of search engineering.</p>\r\n<p>Apple now offers deep app indexing that is significantly different from the app indexing opportunities provided by Google. This is largely due to its public and private indexing frameworks and the methods that marketers can use to get their deep app content indexed.</p>\r\n<p>Apple’s ability to mine iOS user engagement metrics allows them to make engagement a central part of the ranking algorithm, putting less emphasis on traditional ranking factors like titles and descriptions. This is a notable evolution from how Apple currently handles search in the iOS App Store, which relies heavily on titles and keywords to determine app ranking.</p>\r\n<p>The growing opportunity to target more keywords with deep app content should create incentive for app developers to focus slightly more on marketing at earlier stages in app development and force a more strategic and ongoing partnership between SEOs and app developers.</p>\r\n<p>In all the discussion of the new Apple Search and app indexing, the big question that some say has not been adequately addressed is about search volume and tracking. It is unclear how much total search volume and engagement the new Apple Search utilities will get, especially when compared to Google search (and Google’s new ability to <a href=\"http://searchengineland.com/google-brings-app-indexing-support-to-ios-apps-221708\">surface iOS app deep links</a> in their search results).</p>\r\n<p>Will users be drawn to app deep links over traditional web content, or will they even know the difference? Will users begin to prefer a Spotlight Search to find new apps and app content? Will they still prefer App Store searches, or will the lines between Apple search utilities continue to blur, leading to a single, app-centric Spotlight-Safari-Siri dashboard interface that can fast track app total domination over the web?</p>\r\n<p>For some companies whose apps lack website parity and others whose apps have extensive private or personalized content, Apple Search currently represents the <em>only</em> opportunity to get their app content indexed, but the overall impact of Apple Search remains to seen.</p>\r\n<p>While Apple Search presents many opportunities for new exposure on Apple devices, developers will have to work within Apple’s new app indexing framework, and optimize for a variety of indexes, using new proprietary Apple methods. Success will be limited by the volume of search that Apple Search outlets can carve out from their loyal audience, and the impact of search optimization initiatives will be much more challenging to measure.</p>\r\n<p>Since Apple’s push for privacy is something Google won’t match (at least, not yet, and not without completely changing the company’s data-collection practices), we expect Apple to make more key investments in privacy-focused features. Remember, Apple’s business model is based on turning a profit on their own products, not based on helping marketers turn a profit on theirs. If Apple believes users will pay more for privacy (or the illusion of privacy), they will have no problem restricting data from marketers.</p>\r\n<p>Conversely, if Apple believes they can turn more of a profit by selling access to Apple Search data, we may see new products targeted at marketers in the future — for a price. (Remember how expensive those iAds were?) Apple has historically been late to provide even basic analytics to marketers, so Apple Search could provide little to no access over many of the metrics we already enjoy in Google Analytics.</p>\r\n<p>While we appreciate Apple’s <a href=\"https://developer.apple.com/videos/wwdc/2015/?id=709\" target=\"_blank\">video explanation</a> of what they’re doing with Apple Search and the amount of time they are giving SEOs and developers to prepare for these changes, many questions about the technology remain unanswered. We are left wondering: Does Apple plan to use some version of QDF to determine NSUserActivity promotion into the public Cloud Index?</p>\r\n<p>In other words, will a sudden increase of people engaging with a publicly indexable NSUserActivity (like a Bruins game in the NHL app) cause the activity to get promoted to the public Cloud Index before activities with more total views but less recent traffic (such as a Bruins team roster screen)? Will the fresher activity rank higher because of its timeliness? Conversely, when people stop engaging with fresh user activities, will they get “demoted” back down to the private Device Index (or, say, replaced with a more recent Bruins game)?</p>\r\n<p>What questions do you have? Let us know in the comments.</p>\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t<hr/>\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<p><em>Some opinions expressed in this article may be those of a guest author and not necessarily Search Engine Land. Staff authors are listed <a href=\"/staff\">here</a>.</em></p>\r\n\t\t\t\t\t\t\t<hr/>\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t<div>\r\n\t<a href=\"http://searchmarketingexpo.com/east/?utm_source=ml&amp;utm_medium=display&amp;utm_campaign=smx+east+2015&amp;utm_content=module\"><img src=\"/images/partners/east15_800x250_b.jpg\"/></a>\r\n\t<p>\r\n\t\tBe a part of the world's largest search marketing conference, Search Engine Land's <a href=\"http://searchmarketingexpo.com/east/?utm_source=sel&amp;utm_medium=module&amp;utm_campaign=smx+east+2015\">SMX East</a>. The robust <a href=\"http://searchmarketingexpo.com/east/agenda/?utm_source=sel&amp;utm_medium=module&amp;utm_campaign=smx+east+2015\">agenda</a> covers the latest tactics in paid search, SEO, mobile, analytics and more. <a href=\"http://searchmarketingexpo.com/east/register/?utm_source=sel&amp;utm_medium=module&amp;utm_campaign=smx+east+2015\">Register today</a> and save $300, or come as a team and save 10%-20%.</p>\r\n\t\t<p>\t\r\n\t</p>\r\n</div>\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t<div class=\"about-author row\">\r\n\t<h3>About The Author</h3>\r\n\t<div class=\"information col-lg-12 col-md-12 col-sm-12\">\r\n\t\t<div class=\"author-module\">\r\n\t\t\t<div class=\"avatar\">\r\n\t\t\t<img src=\"/images/authors/EmilyGrossman-lg.jpg\"/>\t\t\t</div>\r\n\t\t\t<div class=\"about\">\r\n\t\t\t\t\r\n\t\t\t\t<p class=\"twitter\">\r\n\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t</p><p>\r\n\t\t\t\tEmily Grossman is a Mobile Marketing Specialist at MobileMoxie, and has been working with mobile apps since the early days of the app stores in 2010. She specializes in app search marketing, with a focus on strategic deep linking, app indexing, app launch strategy, and app store optimization (also known as ASO). Emily has spoken about mobile application marketing at national and international conferences and has collaborated with major US brands on their mobile marketing and mobile app strategies. Before her work at MobileMoxie, Emily was one of the original employees at Double Encore, Inc, one of the first mobile applications development agencies (acquired by WPP’s POSSIBLE in 2014).\t\t\t</p></div>\r\n\t\t</div>\r\n\t</div>\r\n</div>\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\r\n\t\t\t\t\t\t\t<h6>(Some images used under license from <a href=\"http://www.shutterstock.com/\" rel=\"nofollow\">Shutterstock.com</a>.)</h6>\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t</div>\r\n\t\t\t\t\r\n\t\t\t\t\t\t</div></body></html>",
			"url_domain": "searchengineland.com",
			"slug": "2015-07-15-app-indexing-the-new-frontier-of-seo",
			"title": "新时代的SEO：给App建索引",
			"url": "http://searchengineland.com/app-indexing-new-frontier-seo-apple-search-ios-app-indexing-223880",
			"readable_title": "App Indexing & The New Frontier of SEO: Apple Search + iOS App Indexing",
			"created_at": 1436929957420,
			"summary": "今年的Google I/O与Apple的WWDC上，这俩公司都宣布了对App建索引的事情。对网页进行SEO早已是一个行业了，那么对App如何做SEO？iOS 9里影响搜索结果排序的因素有哪些",
			"content": "<p>今年的Google I/O与Apple的WWDC上，这俩公司都宣布了对App建索引的事情。对网页进行SEO早已是一个行业了，那么对App如何做SEO？iOS 9里影响搜索结果排序的因素有哪些？</p>",
			"issue_id": 919
		}, {
			"picture": "",
			"tags": ["apple", "applepay"],
			"id": 1532,
			"readable_article": "<html><body><div><div class=\"section-inner layoutSingleColumn\"><p name=\"de58\" id=\"de58\" class=\"graf--p graf--first\">In my opinion, while most of the media focus on this week’s product launch was around iPhone6 or the potential of AppleWatch, the real long term opportunity is in ApplePay. In one fell swoop, I think Apple has now positioned itself to completely disrupt the US (and potentially international) banking infrastructure in the next 10–20 years and make many trillion (yes, trillion) dollars of incremental revenue doing it. Here’s how:</p><h3 name=\"61f0\" id=\"61f0\" class=\"graf--h3\">Step 1:</h3><h4 name=\"1859\" id=\"1859\" class=\"graf--h4\">Co-opt the existing infrastructure</h4><p name=\"ec2f\" id=\"ec2f\" class=\"graf--p graf--empty\"><br/></p><p name=\"3d91\" id=\"3d91\" class=\"graf--p\">By working with Visa/MC/Amex, Apple has replayed its masterstroke with the music labels that seeded their iPod and eventual iPhone business lines. Apple has convinced these major entities to support a system that today will enable more seamless payments, validate existing rails and continue to allow Visa/MC/Amex to validate their existence to issuing banks. But over time, what they’ve really done is co-opt these companies in a way that will render issuing banks as just a set of merchant acquirers — which probably isn’t a business that can create the margins that banks would need to support their current overhead.</p><h3 name=\"a3ff\" id=\"a3ff\" class=\"graf--h3\">Step 2:</h3><h4 name=\"8d98\" id=\"8d98\" class=\"graf--h4\">Get broad deployment of terminals</h4><p name=\"1072\" id=\"1072\" class=\"graf--p graf--empty\"><br/></p><p name=\"628b\" id=\"628b\" class=\"graf--p\">Because of their support for the existing infrastructure, they eliminate the barriers that could prevent 3rd parties, VARs, etc from pushing the adoption of the payment terminals needed to support Apple Pay.</p><h3 name=\"b6c4\" id=\"b6c4\" class=\"graf--h3\">Step 3:</h3><h4 name=\"00ae\" id=\"00ae\" class=\"graf--h4\">Disintermediate Point-of-Sale all together</h4><p name=\"4123\" id=\"4123\" class=\"graf--p graf--empty\"><br/></p><p name=\"a903\" id=\"a903\" class=\"graf--p\">Why do we need a POS in a few years if the phones, themselves are more secure? I suspect that in a few years (or earlier), Apple will unveil a way for the phone to act as a terminal and accept payment from another phone. This would dramatically accelerate the adoption of NFC payment terminals as any merchant with an iPhone (or iPad) would immediately be able to accept ApplePay by going through a simple online on-boarding versus a convoluted, time consuming merchant acquisition process.</p><h3 name=\"5ea8\" id=\"5ea8\" class=\"graf--h3\">Step 4:</h3><h4 name=\"6374\" id=\"6374\" class=\"graf--h4\">Warehouse money flows</h4><p name=\"a5bc\" id=\"a5bc\" class=\"graf--p graf--empty\"><br/></p><p name=\"7498\" id=\"7498\" class=\"graf--p\">This is the arguably the most difficult but most profitable step. If Step 3 takes place, then Apple has a very simple decision to make: what value exists by using the existing rails to essentially transfer money from one iTunes account to another (ie: a user on one iPhone buying something from someone else on another iPhone)? Instead, they would quickly realize that they could entirely eliminate interchange by simply being the centralized database of these transactions and eliminating the concept of a credit card all-together. they can still use the banks to offload and manage risk but they then are consolidating the writing of transactions from disparate banks (and DBs) to one “bank” (Apple) and its DB (iTunes).</p><h3 name=\"1b27\" id=\"1b27\" class=\"graf--h3\">Step 5:</h3><h4 name=\"0bf6\" id=\"0bf6\" class=\"graf--h4\">Take risk</h4><p name=\"f06c\" id=\"f06c\" class=\"graf--p graf--empty\"><br/></p><p name=\"fa85\" id=\"fa85\" class=\"graf--p\">If Apple does any of this, then taking risk and underwriting the transaction itself could become very profitable and obvious. They have your phone, your fingerprint, data on where you are, what you do, what you buy etc so presumably they could do, at a minimum, as good a job as existing players, but most likely a much better job of understanding the risk of every single transaction. in that world, they become a competing “issuer.”</p><blockquote name=\"0e19\" id=\"0e19\" class=\"graf--pullquote pullquote\">Meanwhile, online:</blockquote><p name=\"8719\" id=\"8719\" class=\"graf--p\">What role does Stripe, Braintree, Paypal play in any iOS experience? likely little to none even if these API players integrate with ApplePay. They still have a critical role to play in Android but the iOS opportunity seems quite limited in value. the only issue is the fee that developers would be willing to pay Apple but the tradeoff is simple to model — how much are you willing to pay Apple vs the lift you get from a streamlined purchase flow. if apple is smart and long-term thinking, which i think they are, they will create massive incentives to adopt ApplePay by taking little to no rake so that their fee structure is better for developers/merchants than existing alternatives — another reason why iOS is scorched earth for 3rd parties. when you think about the fact that 30%+ of all mobile traffic in the US is Safari and app traffic from iOS is at least 50%, this is a huge portion of the mobile operating ecosystem that Apple has taken back from 3rd parties.</p><p name=\"a9f3\" id=\"a9f3\" class=\"graf--p\">Lastly, I suspect that as ApplePay rolls out, we start to see a market consolidation with Google being the most aggressive acquirer. Google will need to figure out which components it would need as a platform layer in Android and go and buy those as it seems they haven’t been able to build those thusfar. Stripe for abstractions; Square for merchant acquisition etc.</p><p name=\"24b6\" id=\"24b6\" class=\"graf--p graf--last\">No matter what, ApplePay is a big positive for consumers who should ultimately benefit from more seamless transaction experiences both offline and online, better risk management, better loyalty programs and lower fraud potential. And Apple benefits by creating something awesome and giving themselves the option value to completely take over a trillion dollar market in a few years.</p></div></div></body></html>",
			"url_domain": "medium.com",
			"slug": "2015-07-11-applepay-just-co-opted-a-multi-trillion-dollar-market-medium",
			"title": "Apple Pay 与现有其他金融基础设施共同开创的数千亿美金的市场",
			"url": "https://medium.com/@chamath/applepay-just-co-opted-a-multi-trillion-dollar-market-and-its-awesome-6d0635358547",
			"readable_title": "ApplePay Just Co-opted a Multi-Trillion-Dollar Market",
			"created_at": 1436585281070,
			"summary": "我来补充一点文中没提到的 Apple Pay 的必杀技：得到用户的家庭住址 -- 思考一下，得到这一信息有什么应用？",
			"content": "<p>我来补充一点文中没提到的 Apple Pay 的必杀技：得到用户的家庭住址 -- 思考一下，得到这一信息有什么应用？</p>\r\n<p>文章作者是Chamath Palihapitiya。他帮 1. Winamp 增长到 1 亿用户 (2001)；2. 帮 ICQ 增长到 2.5 亿用户 (2004)；3. 帮 Facebook 增长到 10 亿用户 (2012)。</p>",
			"issue_id": 915
		}, {
			"picture": "https://tctechcrunch2011.files.wordpress.com/2015/06/image0011.jpg?w=560&h=292&crop=1",
			"tags": ["app", "apple", "messaging", "watch"],
			"id": 1475,
			"readable_article": "<html><body><div><div class=\"article-entry text\">\r\n\r\n\r\n<img src=\"https://tctechcrunch2011.files.wordpress.com/2015/06/image0011.jpg?w=738\" class=\"\"/>\r\n<p/>\r\n\r\n<p>Although the Apple Watch boasts the ability to instantly notify users with important updates — breaking news stories, changes to their bank account or the achievement of a fitness goal — its 42mm screen can be a major constraint for developers and designers.</p>\r\n<p>This is especially true for messaging applications, which must figure out how to create an essentials-only design that enables two-way communication without the luxury of a keyboard. When designing a messaging application for the Apple Watch there are several key considerations that must be kept in mind to ensure developers are creating something people will actually use.</p>\r\n<h2>Is the Apple Watch Worthy?</h2>\r\n<p>Jonathan Ive’s team developed the Apple Watch to help solve the problem they themselves created: smartphone addiction. Between the constant influx of notifications and the 24/7 connectivity to work, we are prisoners of our own devices.</p>\r\n<p>Reluctantly, I’ll admit that I’m guilty of this in my personal life. As I play with my kids on a Saturday afternoon in the park, I can’t help but discreetly sneak a look at my phone every few minutes. We just cannot free ourselves from the thought of missing something important.</p>\r\n<p>While critics claim otherwise, the Apple Watch actually frees us from our constant surreptitious phone-checking habit. By filtering the most important alerts and providing immediate notifications that can be absorbed with a glance, the Apple Watch causes users to pick up their phone less frequently and only for matters that involve a response.</p>\r\n<div class=\"writerquote-wrap left pullquote-left\"><blockquote class=\"writerquote\">Between the constant influx of notifications and the 24/7 connectivity to work, we are prisoners of our own devices.</blockquote></div>\r\n<p>Given the nature and purpose of the Apple Watch, the first question companies should ask is whether or not their business app interaction is worthy of immediate interruption. For enterprise messaging, the answer is a resounding Yes. The instant nature of messaging lends itself naturally for a new communication medium like the Apple Watch.</p>\r\n<h2>Starting From Scratch</h2>\r\n<p>Just like every app does not belong on the Apple Watch, every iPhone interface will not transfer to the face of a wristwatch. Over-simplification is important. You may think your iPhone app is sleek and simple, but everything changes when you drastically reduce the screen size.</p>\r\n<p>Simplifying isn’t just about design; it’s about reducing the number of available features on the app. Many of the browsing or text-heavy portions of a smartphone platform are no longer applicable on the watch form factor, requiring developers to determine which features are used the most and eliminate the rest.</p>\r\n<p>Color palettes on the Apple Watch also matter. Despite the assumption that a color palette would be the easiest part of the Apple Watch transition, it usually cannot be replicated from the smartphone. The Apple Watch’s black background and small screen size completely change the game, meaning that the de-saturated colors often used in traditional branding appear muted and are difficult to read, which forces designers to switch over to bright, high-contrast colors.</p>\r\n<h2>The Need For Context-Intelligent Responses</h2>\r\n<p>First and foremost, the Apple Watch is a notification platform. Punching out a lengthy message isn’t feasible without a keyboard, so messaging apps face a unique challenge not met by notification-based platforms. As we worked to solve this problem, we kept coming back to one central theme: speed.</p>\r\n<p>Apple Watch users should be able to glance down at their wrist, instantly absorb the information they need and move on with their day. This is why Apple’s User Interface Guidelines suggest that app developers keep all interactions with the watch to less than 30 seconds.</p>\r\n<p>With a 30-second time constraint, how do you empower users to read a notification and reply, while avoiding the often-awkward voice response? We focused on context-intelligent emojis and canned text responses to reply quickly. While the basic forms of both of these technologies have been available for years, they lacked context and the ability to accurately predict a user’s reply. That’s beginning to change.</p>\r\n<p>Right now, enterprise messaging applications offer a series of canned responses, such as “Yes, I’m available now” or “We closed the deal.” Eventually, messaging applications will be able to gather relevant data to enable the creation of personalized and relevant response options.</p>\r\n<p>For example, if a colleague asks to do lunch at 1pm, the app could gather information from a user’s calendar, current location, past preferences and outside data (such as access to OpenTable) to suggest personalized responses, such as “I’m not available until 1:30. Let’s meet at Salt House on Mission Street. They have tables available at that time.”</p>\r\n<h2>Looking Ahead</h2>\r\n<p>With the recent watchOS 2 announcement, which will support native apps as well as third-party complications, it is clear Apple views enriched third-party apps as critical to delivering a fully integrated wearable experience. Still, the full potential of messaging apps will not be realized until the Apple Watch can function without the iPhone.</p>\r\n<p>Independent of this crutch, and with the capabilities of everything from instant communication to project management, the Apple Watch stands to become the ultimate convener, allowing users to seamlessly manage both their personal and professional lives.</p>\r\n\r\n\r\n\r\n\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t</div>\r\n\r\n</div></body></html>",
			"url_domain": "techcrunch.com",
			"slug": "2015-07-01-messaging-and-the-apple-watch",
			"title": "Messaging And The Apple Watch",
			"url": "http://techcrunch.com/2015/06/26/messaging-and-the-apple-watch/?ncid=rss",
			"readable_title": "Messaging And The Apple Watch",
			"created_at": 1435724648732,
			"summary": "Watch很适合推送消息。但通讯是双向的，你收到别人发来的信息，却没法回复（Watch上没键盘、系统预设的文字回复不够用），是很糟糕的事情。",
			"content": "Watch很适合推送消息。但通讯是双向的，你收到别人发来的信息，却没法回复（Watch上没键盘、系统预设的文字回复不够用），是很糟糕的事情。",
			"issue_id": 905
		}, {
			"picture": "",
			"tags": ["apple", "appstore"],
			"id": 1463,
			"readable_article": "<html><body><div><div id=\"content\">\r\n\r\n\t\t\t\t<header class=\"icon-title padding-bottom-40\">\r\n\t\t\t\t\t<h1>App Store Review Guidelines</h1>\r\n\t\t\t\t</header>\r\n\r\n\t\t\t\t\t<h2 class=\"padding-top-20\">Introduction</h2>\r\n\t\t\t\t\t<p class=\"thirteen\">We're pleased that you want to invest your talents and time to develop applications for iOS. It has been a rewarding experience - both professionally and financially - for hundreds of thousands of developers and we want to help you join this successful group. We have published our App Store Review Guidelines in the hope that they will help you steer clear of issues as you develop your App and speed you through the approval process when you submit it.</p>\r\n\r\n\t\t\t\t\t<p class=\"thirteen\">We view Apps different than books or songs, which we do not curate. If you want to criticize a religion, write a book. If you want to describe sex, write a book or a song, or create a medical App. It can get complicated, but we have decided to not allow certain kinds of content in the App Store. It may help to keep some of our broader themes in mind:</p>\r\n\r\n\r\n\t\t\t\t\t<ul class=\"square\">\r\n\t\t\t\t\t\t<li>We have lots of kids downloading lots of Apps. Parental controls work great to protect kids, but you have to do your part too. So know that we're keeping an eye out for the kids.</li>\r\n\t\t\t\t\t\t<li>We have over a million Apps in the App Store. If your App doesn't do something useful, unique or provide some form of lasting entertainment, or if your app is plain creepy, it may not be accepted.</li>\r\n\t\t\t\t\t\t<li>If your App looks like it was cobbled together in a few days, or you're trying to get your first practice App into the store to impress your friends, please brace yourself for rejection. We have lots of serious developers who don't want their quality Apps to be surrounded by amateur hour.</li>\r\n\t\t\t\t\t\t<li>We will reject Apps for any content or behavior that we believe is over the line. What line, you ask? Well, as a Supreme Court Justice once said, \"I'll know it when I see it\". And we think that you will also know it when you cross it.</li>\r\n\t\t\t\t\t\t<li>If your App is rejected, we have a Review Board that you can appeal to. If you run to the press and trash us, it never helps.</li>\r\n\t\t\t\t\t\t<li>If you attempt to cheat the system (for example, by trying to trick the review process, steal data from users, copy another developer's work, or manipulate the ratings) your Apps will be removed from the store and you will be expelled from the developer program.</li>\r\n\t\t\t\t\t\t<li>This is a living document, and new Apps presenting new questions may result in new rules at any time. Perhaps your App will trigger this.</li>\r\n\t\t\t\t\t</ul>\r\n\t\t\t\t\t<p class=\"thirteen\">Lastly, we love this stuff too, and honor what you do. We're really trying our best to create the best platform in the world for you to express your talents and make a living too. If it sounds like we're control freaks, well, maybe it's because we're so committed to our users and making sure they have a quality experience with our products. Just like almost all of you are, too.</p>\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\">Table of Contents</h2>\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"terms-conditions\">1. Terms and conditions</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>1.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>As a developer of Apps for the App Store you are bound by the terms of the <a href=\"/membercenter/index.action#agreements\">Program License Agreement</a> (PLA), Human Interface Guidelines (HIG), and any other licenses or contracts between you and Apple. The following rules and examples are intended to assist you in gaining acceptance for your App in the App Store, not to amend or remove provisions from any other agreement.</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"functionality\">2. Functionality</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that crash will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that exhibit bugs will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that do not perform as advertised by the developer will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that include undocumented or hidden features inconsistent with the description of the App will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.5</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that use non-public APIs will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.6</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that read or write data outside its designated container area will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.7</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that download code in any way or form will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.8</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that install or launch other executable code will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.9</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that are \"demo\", \"trial\", or \"test\" versions will be rejected. Beta Apps may only be submitted through TestFlight and must follow the TestFlight guidelines</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.10</h3>\r\n\t\t\t\t\t\t\t\t\t<p>iPhone Apps must also run on iPad without modification, at iPhone resolution, and at 2X iPhone 3GS resolution</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.11</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that duplicate Apps already in the App Store may be rejected, particularly if there are many of them, such as fart, burp, flashlight, and Kama Sutra Apps</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.12</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that are not very useful, unique, are simply web sites bundled as Apps, or do not provide any lasting entertainment value may be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.13</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that are primarily marketing materials or advertisements will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.14</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that are intended to provide trick or fake functionality that are not clearly marked as such will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.15</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps larger than 100MB in size will not download over cellular networks (this is automatically prohibited by the App Store)</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.16</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Multitasking Apps may only use background services for their intended purposes: VoIP, audio playback, location, task completion, local notifications, etc.</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.17</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that browse the web must use the iOS WebKit framework and WebKit Javascript</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.18</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that encourage excessive consumption of alcohol or illegal substances, or encourage minors to consume alcohol or smoke cigarettes, will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.19</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that provide incorrect diagnostic or other inaccurate device data will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.20</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Developers \"spamming\" the App Store with many versions of similar Apps will be removed from the iOS Developer Program</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.21</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that are simply a song or movie should be submitted to the iTunes store. Apps that are simply a book should be submitted to the iBooks Store</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.22</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that arbitrarily restrict which users may use the App, such as by location or carrier, may be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.23</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps must follow the <a href=\"/icloud/documentation/data-storage/\">iOS Data Storage Guidelines</a> or they will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.24</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that are offered in Newsstand must comply with schedules 1, 2 and 3 of the <a href=\"/membercenter/index.action#agreements\">Program License Agreement</a> or they will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.25</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that display Apps other than your own for purchase or promotion in a manner similar to or confusing with the App Store will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>2.26</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps may display and recommend apps other than your own only if the collection is designed for a specific approved need (e.g. health management, aviation, accessibility, etc.) or provides significant added value for a specific group of customers, or they will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps or metadata that mentions the name of any other mobile platform will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps with placeholder text will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps with names, descriptions, screenshots, or previews not relevant to the content and functionality of the App will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>App names in iTunes Connect and as displayed on a device should be similar, so as not to cause confusion</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.5</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Small and large App icons should be similar, so as to not to cause confusion</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.6</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps with App icons, screenshots, and previews that do not adhere to the 4+ age rating will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.7</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps with Category and Genre selections that are not appropriate for the App content will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.8</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Developers are responsible for assigning appropriate ratings to their Apps. Inappropriate ratings may be changed/deleted by Apple</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.9</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Developers are responsible for assigning appropriate keywords for their Apps. Inappropriate keywords may be changed/deleted by Apple</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.10</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Developers who attempt to manipulate or cheat the user reviews or chart ranking in the App Store with fake or paid reviews, or any other inappropriate methods will be removed from the iOS Developer Program</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.11</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that recommend that users restart their iOS device prior to installation or launch may be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.12</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps should have all included URLs fully functional when you submit it for review, such as support and privacy policy URLs</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.13</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps with screenshots, previews, and marketing text that do not clearly identify supplemental content or items that must be purchased separately (e.g. using IAP) will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.14</h3>\r\n\t\t\t\t\t\t\t\t\t<p>App previews may only use video screen captures of the app, voice-overs, and textual and design overlays, or the app will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.15</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps with previews that display personal information of a real person without permission will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.16</h3>\r\n\t\t\t\t\t\t\t\t\t<p>App previews may only include music that is licensed for that purpose in all selected territories</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>3.17</h3>\r\n\t\t\t\t\t\t\t\t\t<p>App previews that include content played or streamed via the app (e.g. iTunes playlist, YouTube streaming video) that is not licensed for use in the preview will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"location\">4. Location</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>4.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that do not notify and obtain user consent before collecting, transmitting, or using location data will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>4.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that use location-based APIs for automatic or autonomous control of vehicles, aircraft, or other devices will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>4.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that use location-based APIs for emergency services will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>4.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Location data can only be used when directly relevant to the features and services provided by the App to the user or to support approved advertising uses</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"push-notifications\">5. Push Notifications</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>5.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that provide Push Notifications without using the Apple Push Notification (APN) API will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>5.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that use the APN service without obtaining a Push Application ID from Apple will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>5.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that send Push Notifications without first obtaining user consent, as well as apps that require Push Notifications to function, will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>5.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that send sensitive personal or confidential information using Push Notifications will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>5.5</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that use Push Notifications to send unsolicited messages, or for the purpose of phishing or spamming will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>5.6</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps cannot use Push Notifications to send advertising, promotions, or direct marketing of any kind</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>5.7</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps cannot charge users for use of Push Notifications</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>5.8</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that excessively use the network capacity or bandwidth of the APN service or unduly burden a device with Push Notifications will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>5.9</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that transmit viruses, files, computer code, or programs that may harm or disrupt the normal operation of the APN service will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"game-center\">6. Game Center</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>6.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that display any Player ID to end users or any third party will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>6.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that use Player IDs for any use other than as approved by the Game Center terms will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>6.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Developers that attempt to reverse lookup, trace, relate, associate, mine, harvest, or otherwise exploit Player IDs, aliases, or other information obtained through Game Center will be removed from the iOS Developer Program</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>6.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Game Center information, such as Leaderboard scores, may only be used in Apps approved for use with Game Center</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>6.5</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that use the Game Center service to send unsolicited messages, or for the purpose of phishing or spamming will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>6.6</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that excessively use the network capacity or bandwidth of Game Center will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>6.7</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that transmit viruses, files, computer code, or programs that may harm or disrupt the normal operation of the Game Center service will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<a id=\"iads\"/>\r\n\t\t\t\t\t\t\t<a id=\"iad\"/>\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"advertising\">7. Advertising</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>7.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that artificially increase the number of impressions or click-throughs of ads will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>7.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that contain empty iAd banners will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>7.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that are designed predominantly for the display of ads will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"trademarks-trade-dress\">8. Content and Intellectual Property Rights</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>8.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps must comply with all terms and conditions explained in the <a href=\"http://www.apple.com/legal/trademark/guidelinesfor3rdparties.html\">Guidelines for Using Apple Trademarks and Copyrights</a> and the <a href=\"http://www.apple.com/legal/trademark/appletmlist.html\">Apple Trademark List</a></p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>8.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that suggest or infer that Apple is a source or supplier of the App, or that Apple endorses any particular representation regarding quality or functionality will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>8.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that appear confusingly similar to an existing Apple product, interface, or advertising theme will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>8.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that misspell Apple product names in their App name (i.e., GPS for Iphone, iTunz) will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>8.5</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps may not use protected third party material such as trademarks, copyrights, patents or violate 3rd party terms of use. Authorization to use such material must be provided upon request</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>8.6</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that include the ability to download music or video content from third party sources (e.g. YouTube, SoundCloud, Vimeo, etc) without explicit authorization from those sources will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"media-content\">9. Media content</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>9.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that do not use the MediaPlayer framework to access media in the Music Library will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>9.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>App user interfaces that mimic any iPod or iTunes interface will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>9.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Audio streaming content over a cellular network may not use more than 5MB over 5 minutes</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>9.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Video streaming content over a cellular network longer than 10 minutes must use HTTP Live Streaming and include a baseline 192 kbps or lower HTTP Live stream</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"user-interface\">10. User interface</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>10.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps must comply with all terms and conditions explained in the <a href=\"/library/ios/documentation/userexperience/conceptual/mobilehig/\">Apple iOS Human Interface Guidelines</a></p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>10.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that look similar to Apps bundled on iOS or Watch OS devices, including the App Store, iTunes Store, and iBooks Store, will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>10.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that do not use system provided items, such as buttons and icons, correctly and as described in the <a href=\"/library/ios/documentation/userexperience/conceptual/mobilehig/\">Apple iOS Human Interface Guidelines</a> may be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>10.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that create alternate desktop/home screen environments or simulate multi-App widget experiences will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>10.5</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that alter the functions of standard switches, such as the Volume Up/Down and Ring/Silent switches, will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>10.6</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apple and our customers place a high value on simple, refined, creative, well thought through interfaces. They take more work but are worth it. Apple sets a high bar. If your user interface is complex or less than very good, it may be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>10.7</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Watch Apps whose primary function is telling time will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"purchasing-currencies\">11. Purchasing and currencies</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that unlock or enable additional features or functionality with mechanisms other than the App Store will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps utilizing a system other than the In-App Purchase API (IAP) to purchase content, functionality, or services in an App will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps using IAP to purchase physical goods or goods and services used outside of the App will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that use IAP to purchase credits or other currencies must consume those credits within the App</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.5</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that use IAP to purchase credits or other currencies that expire will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.6</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Content subscriptions using IAP must last a minimum of 7 days and be available to the user from all of their iOS devices</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.7</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that use IAP to purchase items must assign the correct Purchasability type</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.8</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that use IAP to purchase access to built-in capabilities provided by iOS, such as the camera or the gyroscope, will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.9</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps containing content or services that expire after a limited time will be rejected, except for specific approved content (e.g. films, television programs, music, books)</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.10</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Insurance Apps must be free, in legal-compliance in the regions distributed, and cannot use IAP</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.11</h3>\r\n\t\t\t\t\t\t\t\t\t<p>In general, the more expensive your App, the more thoroughly we will review it</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.12</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps offering subscriptions must do so using IAP, Apple will share the same 70/30 revenue split with developers for these purchases, as set forth in the <a href=\"/membercenter/index.action#agreements\">Program License Agreement</a></p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.13</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that link to external mechanisms for purchases or subscriptions to be used in the App, such as a \"buy\" button that goes to a web site to purchase a digital book, will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.14</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps can read or play approved content (specifically magazines, newspapers, books, audio, music, video and cloud storage) that is subscribed to or purchased outside of the App, as long as there is no button or external link in the App to purchase the approved content. Apple will only receive a portion of revenues for content purchased inside the App</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.15</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps may only use auto-renewing subscriptions for periodicals (newspapers, magazines), business Apps (enterprise, productivity, professional creative, cloud storage), and media Apps (video, audio, voice), or the App will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.16</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps may enable additional approved features or functionality when used in combination with specific approved physical products (such as a toy) as long as the additional features and functionality are either completely dependent on such hardware (for example an App that is used to control a telescope) or also available through the App without the physical products, such as by way of reward for achievement or by use of IAP</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>11.17</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps may facilitate transmission of approved virtual currencies provided that they do so in compliance with all state and federal laws for the territories in which the app functions</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\r\n\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"scraping-aggregation\">12. Scraping and aggregation</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>12.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that scrape any information from Apple sites (for example from <a href=\"http://apple.com\">apple.com</a>, iTunes Store, App Store, iTunes Connect, Apple Developer Programs, etc.) or create rankings using content from Apple sites and services will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>12.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps may use approved Apple RSS feeds such as the iTunes Store RSS feed</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>12.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that are simply web clippings, content aggregators, or a collection of links, may be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"damage-device\">13. Damage or injury</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>13.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that encourage users to use an Apple Device in a way that may cause damage to the device will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>13.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that rapidly drain the device's battery or generate excessive heat will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>13.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps whose use may result in physical harm may be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"personal-attacks\">14. Personal attacks</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>14.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Any App that is defamatory, offensive, mean-spirited, or likely to place the targeted individual or group in harm's way will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>14.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Professional political satirists and humorists are exempt from the ban on offensive or mean-spirited commentary</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>14.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that display user generated content must include a method for filtering objectionable material, a mechanism for users to flag offensive content, and the ability to block abusive users from the service</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"violence\">15. Violence</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>15.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps portraying realistic images of people or animals being killed or maimed, shot, stabbed, tortured or injured will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>15.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that depict violence or abuse of children will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>15.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>\"Enemies\" within the context of a game cannot solely target a specific race, culture, a real government or corporation, or any other real entity</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>15.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps involving realistic depictions of weapons in such a way as to encourage illegal or reckless use of such weapons will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>15.5</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that include games of Russian roulette will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"objectionable-content\">16. Objectionable content</h2>\r\n\t\t\t\t\t\t\t\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"privacy\">17. Privacy</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>17.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps cannot transmit data about a user without obtaining the user's prior permission and providing the user with access to information about how and where the data will be used</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>17.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that require users to share personal information, such as email address and date of birth, in order to function will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>17.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps may ask for date of birth (or use other age-gating mechanisms) only for the purpose of complying with applicable children's privacy statutes, but must include some useful functionality or entertainment value regardless of the user's age</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>17.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that collect, transmit, or have the capability to share personal information (e.g. name, address, email, location, photos, videos, drawings, the ability to chat, other personal data, or persistent identifiers used in combination with any of the above) from a minor must comply with applicable children's privacy statutes, and must include a privacy policy</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>17.5</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that include account registration or access a user’s existing account must include a privacy policy or they will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"pornography\">18. Pornography</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>18.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps containing pornographic material, defined by Webster's Dictionary as \"explicit descriptions or displays of sexual organs or activities intended to stimulate erotic rather than aesthetic or emotional feelings\", will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>18.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that contain user generated content that is frequently pornographic (e.g. \"Chat Roulette\" Apps) will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"religion-culture-ethnicity\">19. Religion, culture, and ethnicity</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>19.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps containing references or commentary about a religious, cultural or ethnic group that are defamatory, offensive, mean-spirited or likely to expose the targeted group to harm or violence will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>19.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps may contain or quote religious text provided the quotes or translations are accurate and not misleading. Commentary should be educational or informative rather than inflammatory</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"contests\">20. Contests, sweepstakes, lotteries, raffles, and gambling</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>20.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Sweepstakes and contests must be sponsored by the developer/company of the App</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>20.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Official rules for sweepstakes and contests must be presented in the App and make it clear that Apple is not a sponsor or involved in the activity in any manner</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>20.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>It must be permissible by law for the developer to run a lottery App, and a lottery App must have all of the following characteristics: consideration, chance, and a prize</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>20.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that allow a user to directly purchase a raffle ticket in the App will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>20.5</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that offer real money gaming (e.g. sports betting, poker, casino games, horse racing) or lotteries must have necessary licensing and permissions in the locations where the App is used, must be restricted to those locations, and must be free on the App Store</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>20.6</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that use IAP to purchase credit or currency to use in conjunction with real money gaming will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"charities-contributions\">21. Charities and contributions</h2>\r\n\t\t\t\t\t\t\t\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"legal-requirements\">22. Legal requirements</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>22.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps must comply with all legal requirements in any location where they are made available to users. It is the developer's obligation to understand and conform to all local laws</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>22.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that contain false, fraudulent or misleading representations or use names or icons similar to other Apps will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>22.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that solicit, promote, or encourage criminal or clearly reckless behavior will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>22.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that enable illegal file sharing will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>22.5</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that are designed for use as illegal gambling aids, including card counters, will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>22.6</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that enable anonymous or prank phone calls or SMS/MMS messaging will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>22.7</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Developers who create Apps that surreptitiously attempt to discover user passwords or other private user data will be removed from the iOS Developer Program</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>22.8</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that contain DUI checkpoints that are not published by law enforcement agencies, or encourage and enable drunk driving, will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>22.9</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that calculate medicinal dosages must be submitted by the manufacturer of those medications or recognized institutions such as hospitals, insurance companies, and universities</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>22.10</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that use iTunes music previews in an unauthorized manner will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"passbook\">23. Passbook</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>23.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Passbook Passes can be used to make or receive payments, transmit offers, or offer identification (such as movie tickets, airline tickets, coupons and reward offers). Other uses may result in the rejection of the App and the revocation of Passbook credentials</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>23.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Passes must include valid contact information from the issuer of the pass or the App will be rejected and Passbook credentials may be revoked</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>23.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Passes must be signed by the entity that will be distributing the pass under its own name, trademark, or brand or the App will be rejected and Passbook credentials may be revoked</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"kids-category\">24. Kids Category</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>24.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps in the Kids Category must include a privacy policy and must comply with applicable children's privacy statutes</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>24.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps in the Kids Category may not include behavioral advertising (e.g. the advertiser may not serve ads based on the user's activity within the App), and any contextual ads presented in the App must be appropriate for kids</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>24.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps in the Kids Category must get parental permission or use a parental gate before allowing the user to link out of the app or engage in commerce</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>24.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps in the Kids Category must be made specifically for kids ages 5 and under, ages 6-8, or ages 9-11</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"extensions\">25. Extensions</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>25.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps hosting extensions must comply with the <a href=\"/library/prerelease/ios/documentation/General/Conceptual/ExtensibilityPG/index.html\">App Extension Programming Guide</a></p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>25.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps hosting extensions must provide some functionality (help screens, additional settings) or they will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>25.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps hosting extensions that include marketing, advertising, or in-app purchases in their extension view will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>25.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Keyboard extensions must provide a method for progressing to the next keyboard</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>25.5</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Keyboard extensions must remain functional with no network access or they will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>25.6</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Keyboard extensions must provide Number and Decimal keyboard types as described in the <a href=\"/library/prerelease/ios/documentation/General/Conceptual/ExtensibilityPG/index.html\">App Extension Programming Guide</a> or they will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>25.7</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps offering Keyboard extensions must have a primary category of Utilities and a privacy policy or they will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>25.8</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps offering Keyboard extensions may only collect user activity to enhance the functionality of their keyboard extension on the iOS device or they may be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\r\n\r\n\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"homekit\">26. HomeKit</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>26.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps using the HomeKit framework must have a primary purpose of providing home automation services</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>26.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps using the HomeKit framework must indicate this usage in their marketing text and they must provide a privacy policy or they will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>26.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps must not use data gathered from the HomeKit APIs for advertising or other use-based data mining</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>26.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps using data gathered from the HomeKit API for purposes other than improving the user experience or hardware/software performance in providing home automation functionality will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\r\n\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"healthkit\">27. HealthKit and Human Subject Research</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>27.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps using the HealthKit framework or conducting human subject research for health purposes, such as through the use of ResearchKit, must comply with applicable law for each Territory in which the App is made available, as well as Sections 3.3.28 and 3.3.39 of the <a href=\"/membercenter/index.action#agreements\">iOS Developer Program License Agreement</a></p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>27.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that write false or inaccurate data into HealthKit will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>27.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps using the HealthKit framework that store users’ health information in iCloud will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>27.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps may not use or disclose to third parties user data gathered from the HealthKit API or from health-related human subject research for advertising or other use-based data mining purposes other than improving health, or for the purpose of health research</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>27.5</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that share user data acquired via the HealthKit API with third parties without user consent will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>27.6</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps using the HealthKit framework must indicate integration with the Health app in their marketing text and must clearly identify the HealthKit functionality in the app’s user interface</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>27.7</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps using the HealthKit framework or conducting human subject research must provide a privacy policy or they will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>27.8</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps that provide diagnoses, treatment advice, or control hardware designed to diagnose or treat medical conditions that do not provide written regulatory approval upon request will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>27.9</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps conducting health-related human subject research must obtain consent from participants or, in the case of minors, their parent or guardian. Such consent must include the (a) nature, purpose, and duration of the research; (b) procedures, risks, and benefits to the participant; (c) information about confidentiality and handling of data (including any sharing with third parties); (d) a point of contact for participant questions; and (e) the withdrawal process</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>27.10</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps conducting health-related human subject research must secure approval from an independent ethics review board. Proof of such approval must be provided upon request.</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"testflight\">28. TestFlight</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>28.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps may only use TestFlight to beta test apps intended for public distribution and must comply with the full App Review Guidelines</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>28.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps using TestFlight must be submitted for review whenever a build contains material changes to content or functionality</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>28.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps using TestFlight may not be distributed to testers in exchange for compensation of any kind</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\" id=\"apple-pay\">29. Apple Pay</h2>\r\n\t\t\t\t\t\t\t<ul class=\"subsection\">\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>29.1</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps using Apple Pay must provide all material purchase information to the user prior to sale of any good or service or they will be rejected; Apps using Apple Pay to offer recurring payments must, at a minimum, disclose the length of the renewal term and the fact that it will continue until canceled, what will be provided during each period, the charges that will be billed to the customer, and how to cancel.</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>29.2</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps using Apple Pay must use Apple Pay branding and user interface elements correctly and as described in the <a href=\"/apple-pay/Apple-Pay-Identity-Guidelines.pdf\">Apple Pay Identity Guidelines</a> or they will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>29.3</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps using Apple Pay as a purchasing mechanism may not offer goods or services that violate the law of any territory in which the good or service will be delivered and may not be used for any illegal purpose</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>29.4</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps using Apple Pay must provide a privacy policy or they will be rejected</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\t\t\t<h3>29.5</h3>\r\n\t\t\t\t\t\t\t\t\t<p>Apps using Apple Pay may only share user data acquired via Apple Pay with third parties when provided to facilitate or improve delivery of goods and services or to comply with legal requirements</p>\r\n\t\t\t\t\t\t\t\t</li>\r\n\t\t\t\t\t\t\t</ul>\r\n\r\n\t\t\t\t\t\t\t<h2 class=\"subhead\">Living document</h2>\r\n\t\t\t\t\t\t\t<p class=\"thirteen\">This document represents our best efforts to share how we review Apps submitted to the App Store, and we hope it is a helpful guide as you develop and submit your Apps. It is a living document that will evolve as we are presented with new Apps and situations, and we'll update it periodically to reflect these changes.</p>\r\n\t\t\t\t\t\t\t<p class=\"thirteen\">Thank you for developing for iOS. Even though this document is a formidable list of what not to do, please also keep in mind the much shorter list of what you must do. Above all else, join us in trying to surprise and delight users. Show them their world in innovative ways, and let them interact with it like never before. In our experience, users really respond to polish, both in functionality and user interface. Go the extra mile. Give them more than they expect. And take them places where they have never been before. We are ready to help.</p>\r\n\t\t\t\t\t\t\t<p class=\"updated\">© Apple, 2015</p>\r\n\r\n\t\t</div>\r\n\r\n\r\n\r\n\t</div></body></html>",
			"url_domain": "developer.apple.com",
			"slug": "2015-06-29-app-store-review-guidelines",
			"title": "App Store Review Guidelines",
			"url": "https://developer.apple.com/app-store/review/guidelines/",
			"readable_title": "App Store Review Guidelines",
			"created_at": 1435517253245,
			"summary": "这是Apple的官方文档，比想象中的要短一些。遣词造句不像一个大公司的科技文档，更像是从个人视角写的博客文章。iOS开发者们，你们有没有仔细读过这份文档？",
			"content": "<p>这是Apple的官方文档，比想象中的要短一些。遣词造句不像一个大公司的科技文档，更像是从个人视角写的博客文章。iOS开发者们，你们有没有仔细读过这份文档？</p>\r\n<p>【湾区日报】的<a href=\"https://itunes.apple.com/om/app/wanqu/id995762924\">iOS App</a>新版本原计划6月14日能上线的，已经Wait for review 20多天了。联系了几次Apple客服，都让我耐心等待。最后我直接撤下，换下一个版本，希望能在10天内审批通过。</p>",
			"issue_id": 903
		}, {
			"picture": "https://blog.kissmetrics.com/wp-content/uploads/2013/06/LearnAboutApps-1.png",
			"tags": ["app", "apple"],
			"id": 1430,
			"readable_article": "<html><body><div><div class=\"entry-content\">\r\n\t\r\n\t\t<p>With over 2 million mobile apps in the major app stores, getting your app discovered is one of the biggest issues facing mobile app publishers today. If you’re in the mobile app space, it’s important to understand the various methods for marketing your app. We’d like to share with you one very important technique that continues to be overlooked by most – app store optimization (or ASO for short).</p>\r\n<p><img src=\"https://blog.kissmetrics.com/wp-content/uploads/2013/06/LearnAboutApps-1.png\" alt=\"New Mobile App Discovery Methods\" class=\"aligncenter size-full wp-image-20948\"/></p>\r\n<p align=\"center\"><i>More apps are discovered through search than any other method</i></p>\r\n<h2>So, what is ASO?</h2>\r\n<p>ASO is the process of optimizing mobile apps to rank higher in an app store’s search results. The higher your app ranks in an app store’s search results, the more visible it is to potential customers. That increased visibility tends to translate into more traffic to your app’s page in the app store.</p>\r\n<p><i>The goal of ASO is to drive more traffic to your app’s page in the app store, so searchers can take a specific action:<b> downloading your app.</b></i></p>\r\n<p>Also, the ASO process requires a <i><span>crucial understanding</span></i> of your target customer base, including the keywords your potential customers are using to find apps similar to yours. When you learn more about which keywords are being used, you will have a better understanding of the language of your potential customers – a crucial piece of any marketing plan – and you can home in on your keyword choices.</p>\r\n<h2>Why is ASO important?</h2>\r\n<p>According to Forrester, <a href=\"http://techcrunch.com/2013/04/17/forrester-app-discovery-report/\">63% of apps are discovered through app store </a><a href=\"http://techcrunch.com/2013/04/17/forrester-app-discovery-report/\">searches</a>. This makes search, <i>in the app store</i>, the most used method for discovering and downloading new apps. Recently, at Google I/O, Ankit Jain reported that “<a href=\"http://www.insidemobileapps.com/2013/05/17/google-discloses-how-search-for-google-play-works-for-the-first-time-12-percent-of-dau-search-for-apps-daily/\">For the average app, search actually makes up the vast majority of installs.</a>” Simply put, this means that:</p>\r\n<p><b><i>If you’re not using ASO to increase your app’s search ranking, you’re missing out on the largest discovery channel available to your app.</i></b></p>\r\n<p>With hundreds of thousands of apps in each app store vying to rank above one another, the amazing reality is that the majority of publishers are not investing in app store optimization. So here’s our gift to you: ASO is your secret weapon. Spend time every week improving your ASO, and you will meaningfully impact your app’s ranking and overall success.</p>\r\n<h2>What are the mechanics of ASO?</h2>\r\n<p>Let’s start by breaking down the various components that can affect your ASO:</p>\r\n<h3>Main Factors:</h3>\r\n<ul>\r\n<li><b>Title</b> – The keyword placed in the title should be the one with the heaviest search traffic. Spend time researching which keyword that is, because changing your title often to include different keywords can be detrimental. As your app begins to rank higher and gain more reviews, news of your app will begin to spread by word of mouth. Changing the title can make it difficult for word to spread about your app.</li>\r\n<li><b>Keywords</b> – To improve your search rankings, you need to know which keywords are relevant and used most often by your target audience. It is helpful to monitor competitors in order to realize how you compare week to week.</li>\r\n</ul>\r\n<p>In addition to being the most important factors for ASO, the fact that the title and keywords can be modified easily means that you can regularly optimize them.</p>\r\n<h3>Secondary Factors:</h3>\r\n<ul>\r\n<li><b>Total # of Downloads</b> – Your number of downloads are extremely important to ASO, but you don’t have complete control over them.</li>\r\n<li><b>Ratings and Reviews</b> – Also important and difficult to control. However, there are ways to incentivize happy users to rate and review.</li>\r\n</ul>\r\n<h2>Let’s Talk About Keywords in the Title: Worth It?</h2>\r\n<p>With a sampling of keywords, they looked at the top 25 ranking positions and calculated what percentage of apps had the keyword in the title vs. those that did not. This provided a total aggregate score for the apps with the keyword in the title and the apps without the keyword in the title.</p>\r\n<p><img src=\"https://blog.kissmetrics.com/wp-content/uploads/2013/06/KeywordsInTitle.png\" alt=\"Keywords in title\" class=\"aligncenter size-full wp-image-20949\"/></p>\r\n<p>Based on this test, apps with keywords in the title ranked on average 10.3% higher than those without a keyword in the title.</p>\r\n<p>So, is a keyword worth placing in your title? <b>Yes</b>.</p>\r\n<h2>Do apps with higher ratings rank higher in search results?</h2>\r\n<p>This test was done by taking a random sampling of keywords and categorizing them by difficulty as related to result count. An “easy” keyword results in fewer than 25 apps trying to rank for that keyword. “Medium” keywords are those that are included in 25-100 apps, and “competitive” keywords are those in 100+ apps.</p>\r\n<p><img src=\"https://blog.kissmetrics.com/wp-content/uploads/2013/06/RatingsRankings.png\" alt=\"How app ratings correlate to search rankings\" class=\"aligncenter size-full wp-image-20950\"/></p>\r\n<p>Based on this test, there is a clear trend showing that apps with higher ratings also rank higher for keyword difficulty.</p>\r\n<p>Do apps with better ratings rank higher? <b>Yes</b>.</p>\r\n<p>(But don’t beg for them; earn <a href=\"http://www.apptentive.com/blog/better-ratings-for-your-applications/\">better ratings for your apps</a> the right way.)</p>\r\n<h2>Do more downloads correlate to higher app store search rankings?</h2>\r\n<p>Only the developer and the app store know the number of times an app has been downloaded. Since we do not know the number of downloads, we took the number of ratings instead. The belief here is that, averaged out, the download-to-rating conversion rate is more or less similar across most apps. Therefore, it is fairly accurate to look at the number of ratings as a proxy for the number of downloads.</p>\r\n<p><img src=\"https://blog.kissmetrics.com/wp-content/uploads/2013/06/DownloadsRankings.png\" alt=\"How downloads correlate to search rankings\" class=\"aligncenter size-full wp-image-20951\"/></p>\r\n<p>Again, the results of the test are clear. The trend, regardless of difficulty, showed that apps with more downloads also rank higher.</p>\r\n<p>Do apps with more downloads rank higher? <b>Yes</b>.</p>\r\n<p>It is important to notice the difference between “competitive” keywords and the other difficulties. If your keyword falls into the “competitive” category, you need a significantly larger number of downloads to rank higher.</p>\r\n<h2>Keep in mind that ASO takes time</h2>\r\n<p>ASO is a process that needs to be monitored and constantly tweaked over a period of time. Your optimal set of keywords rarely is the set that you first opt to put in the app store.</p>\r\n<p>Today, the most common approach to ASO is no approach at all. Developers often pick keywords and write descriptions at the last second during an app’s submission process. In most cases, little or no research on keyword searches occurs before the app submission, leaving most apps hidden and the likelihood of discovery quite low.</p>\r\n<p>We had a moment to sit down with Ian Sefferman, the CEO of MobileDevHQ, and he told us how investing time in ASO has affected their customers. He said:</p>\r\n<blockquote><p>“ASO is having dramatic effects on our client apps. For those who put the time in to understand, iterate, and test, we’ve seen many apps increase their downloads by a factor of 2x-10x, and an increase of revenue by a similar, or bigger, rate due to the increase in engagement of users earned by ASO. ASO is not a simple process, and you might not see the impact overnight, but if you’re willing to invest in it, the outcome can be incredibly worthwhile.”</p></blockquote>\r\n<p>App developers need to consistently track their own rankings and the rankings of their competitors over time. More apps are published every day, and the constant stream of new ratings, reviews, and downloads can affect your search rankings. Keep testing and experimenting with your keywords in order to consistently rank well and drive more traffic to your download page.</p>\r\n<h2>Tips for improving your ASO</h2>\r\n<p>To recap, let’s look at the ASO factors and the methods you can use to improve in those areas.</p>\r\n<h3><i>Main Factors</i></h3>\r\n<ul>\r\n<li><b>Title</b> – Having a keyword in your title can improve your app’s search ranking for that keyword by an average of 10.3%. As a best practice, you want to place your most relevant keyword, regardless of the keyword difficulty, in the title.</li>\r\n<li><b>Keywords</b> – Constantly tracking your own keywords and the movement of your competitors takes time and effort. In order to have the time to focus on your app and not solely on ASO, use a service such as <a href=\"http://www.mobiledevhq.com\">MobileDevHQ</a> to track your search rankings, analyze your keywords, choose better keywords, and get updates about your competitors.</li>\r\n</ul>\r\n<h3><i>Secondary Factors</i></h3>\r\n<ul>\r\n<li><b>Total # of Downloads</b> – Now that our gut feelings have been proven with data, what can you do to get more downloads for your app? Improving your ASO is a great place to start. Beyond that, it is about marketing your brand and app to improve recognition, awareness, and appeal, from app store description to images, ratings/reviews, and social media presence. For a great place to start, check out these <a href=\"http://www.seomoz.org/blog/top-three-inbound-marketing-strategies-for-mobile-apps\">three inbound marketing strategies for mobile apps.</a></li>\r\n<p>\u0097\r\n</p><li><b>Ratings and Reviews</b> – As we saw above, apps with higher ratings also ranked higher. This raises a tricky dilemma: you want more ratings and reviews but not if they are negative. So, you need a way to connect with your customers inside your app, giving them a place to vent and talk directly to the developer. On the flip side, you want to guide happy customers to leave positive reviews for you.</li>\r\n</ul>\r\n<p>To reap the rewards of ASO, you need to invest time and effort. If you do, you’ll have a consistent channel driving traffic to your app. Being found is one of the most difficult challenges for mobile apps, but it is a problem you can actively solve.</p>\r\n<p><b>About the Author:</b> Robi Ganguly is the CEO of <a href=\"http://www.apptentive.com/\" rel=\"nofollow\">Apptentive</a>, the easiest way for every company with an app to talk with their customers. When he’s not at the office, you can find him running, reading, cooking, spending time with friends, or hanging out on Twitter (<a href=\"http://www.twitter.com/rganguly\">@rganguly</a>).</p>\r\n\t\t\t\r\n\t</div>\r\n\r\n\t</div></body></html>",
			"url_domain": "blog.kissmetrics.com",
			"slug": "2015-06-24-app-store-optimization-a-crucial-piece-of-the-mobile-app-marketing-puzzle",
			"title": "App Store Optimization (ASO)",
			"url": "https://blog.kissmetrics.com/app-store-optimization/",
			"readable_title": "App Store Optimization - A Crucial Piece of the Mobile App Marketing Puzzle",
			"created_at": 1435112121335,
			"summary": "63%的app是通过app store的搜索被用户发现的。改善ASO的主要因素是app的名字与关键词（你可以完全掌控的），其次是下载量与review（你不能完全控制的）。",
			"content": "<p>\"ASO is the process of optimizing mobile apps to rank higher in an app store’s search results.\" 像SEO吧？</p>\r\n<p>63%的app是通过app store的搜索被用户发现的。ASO主要因素是app的名字与关键词（你可以控制的），其次是下载量与review（你控制不了的）。</p>",
			"issue_id": 896
		}, {
			"picture": "https://d262ilb51hltx0.cloudfront.net/max/1400/1*Z84a8BFv8lXeRWLDUoL60g.png",
			"tags": ["app", "apple", "imessage"],
			"id": 1413,
			"readable_article": "<html><body><div><div class=\"section-content\"><div class=\"section-inner u-sizeFullWidth\"><figure name=\"1c87\" id=\"1c87\" class=\"graf--figure graf--layoutFillWidth graf--first\"><div class=\"aspectRatioPlaceholder is-locked\"><p class=\"aspect-ratio-fill\"/><img class=\"graf-image\" data-image-id=\"1*v6Z-TJrIbmV2n9ovT-2ybw.png\" data-width=\"2334\" data-height=\"1167\" src=\"https://d262ilb51hltx0.cloudfront.net/max/2000/1*v6Z-TJrIbmV2n9ovT-2ybw.png\"/></div><figcaption class=\"imageCaption\">This is not an official Apple graphic. I made it up.</figcaption></figure></div><div class=\"section-inner layoutSingleColumn\"><h3 name=\"cb99\" id=\"cb99\" data-align=\"center\" class=\"graf--h3\">Imagining MessageKit: Apple’s path to turning iMessage into a platform</h3><p name=\"2bca\" id=\"2bca\" class=\"graf--p graf--empty\"><br/></p><p name=\"f040\" id=\"f040\" class=\"graf--p\"><em class=\"markup--em markup--p-em\">It’s been months since I’ve written this piece but just never got around to publishing… I figured while WWDC is going on it might be a good idea to toss out this idea that’s been swimming around in my head for a long time. Without further ado:</em></p><p name=\"b059\" id=\"b059\" class=\"graf--p\">There’s already been a fair amount written on the subject on the future of texting and of messaging-as-an-interface. Jonathan Libov had a pretty comprehensive set of ideas that established how a lightweight texting option could replace many of the apps that we deal with today. In the post title “<a href=\"http://whoo.ps/2015/02/23/futures-of-text\" data-href=\"http://whoo.ps/2015/02/23/futures-of-text\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow\">Futures of Text</a>” he says:</p><blockquote name=\"c8dc\" id=\"c8dc\" class=\"graf--blockquote\">In contrast to a GUI that defines rules for each interaction — rules which, frustratingly, change from app to app — text-based, conversational interactions are liberating in their familiarity. There’s only really only one way to skin this cat: The text I type is displayed on the right, the text someone else typed is on the left, and there’s an input field on bottom for me to compose a message.</blockquote><p name=\"37f4\" id=\"37f4\" class=\"graf--p\">App overload is a real thing. Personally I have 109 apps installed on my iPhone right now, and that’s even after a massive purge about a month ago. I can’t possibly use more than 20% of them on a regular basis. For example, Airbnb, TripIt, Sprig, Lyft, Uber, and Venmo are just a handful of the many apps I need on my phone but don’t use them on a daily basis.</p><p name=\"6f7e\" id=\"6f7e\" data-align=\"center\" class=\"graf--p\"><em class=\"markup--em markup--p-em\">Just yesterday, during the 2015 WWDC keynote, Apple </em><a href=\"http://www.buzzfeed.com/matthewzeitlin/apples-wwdc-by-the-numbers#.bvyJWY48J\" data-href=\"http://www.buzzfeed.com/matthewzeitlin/apples-wwdc-by-the-numbers#.bvyJWY48J\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow\"><em class=\"markup--em markup--p-em\">announced</em></a><em class=\"markup--em markup--p-em\"> that the average iPhone has 119 apps on it. That’s insane!</em></p><p name=\"d15b\" id=\"d15b\" class=\"graf--p\">With that in consideration, the “app” as the sole way I can interface with a service feels unnecessarily heavy handed but rich alternatives don’t exist. As Libov used as an example, <a href=\"http://bustime.mta.info\" data-href=\"http://bustime.mta.info\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow\">NYC’s MTA Bus Time</a> service makes it easy to just text a number and get bus times without need for a dedicated interface. It’s spartan, though it gets the basic job done. However, if you want anything more than just text you’re shit out of luck.</p><p name=\"946e\" id=\"946e\" class=\"graf--p\">Therein lies the opportunity.</p><h3 name=\"de9a\" id=\"de9a\" class=\"graf--h3\">The end of the graphical user interface</h3><p name=\"c1f2\" id=\"c1f2\" class=\"graf--p\">Do we really believe that the <a href=\"http://en.wikipedia.org/wiki/Graphical_user_interface\" data-href=\"http://en.wikipedia.org/wiki/Graphical_user_interface\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow\">GUI</a> is the end-all-be-all way to interface with a computer? With each new app we need to learn how to use it. Sometimes this can be quick, and intuitive, but oftentimes there is a learning curve associated with it.</p><p name=\"87c1\" id=\"87c1\" class=\"graf--p\">Two years ago Ron Kaplan <a href=\"http://www.wired.com/2013/03/conversational-user-interface/\" data-href=\"http://www.wired.com/2013/03/conversational-user-interface/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow\">wrote an article</a> that begged the same question, and made a suggestion that the next evolution of our interaction with computers is the Conversational User Interface. The article itself was ahead of its time but seems to be extremely prescient for today.</p><h3 name=\"6b0e\" id=\"6b0e\" class=\"graf--h3\">There’s a chat for that</h3><p name=\"a084\" id=\"a084\" class=\"graf--p\">What if instead of installing an app, we might instead allow a service to chat with us via iMessage? From that point on, they’re just like any contact in your phone, enabling a two-way conversation to get things done. With each new conversation you’d give relevant permissions for contact and the moment you’d like to end it then the “app” could no longer message you. Easy!</p><p name=\"d7dc\" id=\"d7dc\" class=\"graf--p\"><em class=\"markup--em markup--p-em\">It should be noted that when I say “conversation” I don’t mean that you’re just texting with a service (e.g. Magic, Luka, etc.). Likewise a “conversational user interface” isn’t limited to just text.</em></p><figure name=\"3a05\" id=\"3a05\" class=\"graf--figure\"><div class=\"aspectRatioPlaceholder is-locked\"><p class=\"aspect-ratio-fill\"/><img class=\"graf-image\" data-image-id=\"1*Z84a8BFv8lXeRWLDUoL60g.png\" data-width=\"2484\" data-height=\"2254\" data-action=\"zoom\" data-action-value=\"1*Z84a8BFv8lXeRWLDUoL60g.png\" src=\"https://d262ilb51hltx0.cloudfront.net/max/800/1*Z84a8BFv8lXeRWLDUoL60g.png\"/></div><figcaption class=\"imageCaption\">Example of apps as chats</figcaption></figure><p name=\"4bb9\" id=\"4bb9\" class=\"graf--p\">In the above mockup you can see three different examples of experiences that are currently just apps. At their core, they’re all just handling transactions so why do we need a whole app and a ton of chrome to use their services?</p><p name=\"1b9c\" id=\"1b9c\" class=\"graf--p\"><strong class=\"markup--strong markup--p-strong\">Lyft</strong><br/>Request a ride, confirm the driver, hop in the car, and pay all through a single message stream.</p><p name=\"2ad7\" id=\"2ad7\" class=\"graf--p\"><strong class=\"markup--strong markup--p-strong\">Sprig</strong><br/>Request tonight’s dishes with a button, place an order, and pay all via conversation.</p><p name=\"35a2\" id=\"35a2\" class=\"graf--p\"><strong class=\"markup--strong markup--p-strong\">OpenTable<br/></strong>“Can I get a table for two at Namu Gaji tonight?” and boom, it’s done. Isn’t that so much easier than jumping through all of the hoops of navigating an app?</p><p name=\"b0fa\" id=\"b0fa\" class=\"graf--p\">Obviously there are so many more examples of services that would work beautifully in this experience. For all of those apps that you might otherwise use just once or twice, you might instead just bring up a conversation.</p><p name=\"fae9\" id=\"fae9\" class=\"graf--p\">Additionally, this kind of experience would make onboarding customers dramatically faster and easier. Each conversation would prompt iOS to ask what kind of information be shared, including perhaps your name, photo, and maybe your address. Payment would all be done through Apple Pay, making for ultra fast and seamless transactions.</p><p name=\"4717\" id=\"4717\" class=\"graf--p\"><strong class=\"markup--strong markup--p-strong\">MessageKit</strong> would be similar to Apple’s other *Kits in that it would enable developers to quickly build out an experience based on guides. It would include a permission stack, the ability to create unique input methods, and a way to enable discovery. From a user’s perspective the entire thing would be opt-in. Apps wouldn’t be able to just start messaging you without initiating.</p><h3 name=\"2e03\" id=\"2e03\" class=\"graf--h3\">Imagining what it might look like…</h3></div><div class=\"section-inner sectionLayout--outsetColumn\"><figure name=\"3d2b\" id=\"3d2b\" class=\"graf--figure graf--layoutOutsetCenter\"><div class=\"aspectRatioPlaceholder is-locked\"><p class=\"aspect-ratio-fill\"/><img class=\"graf-image\" data-image-id=\"1*StuWkQKniQz9UL2RoTvRCw.png\" data-width=\"4774\" data-height=\"2808\" data-action=\"zoom\" data-action-value=\"1*StuWkQKniQz9UL2RoTvRCw.png\" src=\"https://d262ilb51hltx0.cloudfront.net/max/1200/1*StuWkQKniQz9UL2RoTvRCw.png\"/></div><figcaption class=\"imageCaption\"><em class=\"markup--em markup--figure-em\">Mockup of what Lyft might look like in a conversational interface, built into the Messages app. The nav bar and response bubbles appear in pink, providing an opportunity for branding.</em></figcaption></figure></div><div class=\"section-inner layoutSingleColumn\"><p name=\"0fed\" id=\"0fed\" class=\"graf--p\">In the above example you can see the user opening up a Lyft conversation for the first time. By tapping the built-in “Request a ride” button it brings up a unique interactive experience that takes up the area that would otherwise have a keyboard. This would be programmed by the app developers themselves to enable whatever kind of input function they’d like. In this case it’s a UI that helps a user identify their location and quickly request a Lyft.</p><p name=\"e56f\" id=\"e56f\" class=\"graf--p\">From there Lyft could send them a message when their ride is on the way and better yet, have a live updating map that shows where they’re at.</p><p name=\"91b0\" id=\"91b0\" class=\"graf--p\">All of this functionality is built into the Lyft app today, but when you strip away all of the chrome, the package it comes in, the use case is quite simple. Installing an app is sometimes a laborious process. Starting a conversation could make things much simpler.</p><p name=\"7cdd\" id=\"7cdd\" class=\"graf--p\">There are a couple of other things that would be necessary to make this whole thing work: First, we need to assume that NLP (natural language processing) is not yet quite good enough to enable humans to converse with computers effectively. Second we need to assume that the vast majority of companies out there wouldn’t want NLP to become a core competency. Thirdly we need to ensure that the end user can have the best possible experience and enable delight.</p><p name=\"19c2\" id=\"19c2\" class=\"graf--p\">So where does that leave us? Here are some ideas:</p><h3 name=\"f584\" id=\"f584\" class=\"graf--h3\">Mad Libs</h3><figure name=\"8fa1\" id=\"8fa1\" class=\"graf--figure\"><div class=\"aspectRatioPlaceholder is-locked\"><p class=\"aspect-ratio-fill\"/><img class=\"graf-image\" data-image-id=\"1*-i97l3xkz-bhk5k0YgvBEg.jpeg\" data-width=\"3300\" data-height=\"2550\" data-action=\"zoom\" data-action-value=\"1*-i97l3xkz-bhk5k0YgvBEg.jpeg\" src=\"https://d262ilb51hltx0.cloudfront.net/max/800/1*-i97l3xkz-bhk5k0YgvBEg.jpeg\"/></div><figcaption class=\"imageCaption\">Mad Libs® example</figcaption></figure><p name=\"5cbb\" id=\"5cbb\" class=\"graf--p\">Do you remember these things? You’d add your own words in to a story, guided by suggestions of using nouns, adjectives, verbs, etc. What if instead of expecting that a user will know the exact way to communicate with a bot, we help them learn the commands via “Mad Libs” like experiences? While typing a message a small suggestion box might pop up to guide the phrase a user may be typing out. That way, when on the receiving end of the message, the bot would be able to have a high probability of parsing the message and succeeding at its task.</p><h3 name=\"eae4\" id=\"eae4\" class=\"graf--h3\">Bubbles with buttons</h3><p name=\"4e0b\" id=\"4e0b\" class=\"graf--p\">Messages with built-in options that would activate certain commands would make the conversation even richer. In the above example with Lyft, you can see a “Request a ride” button directly within a message. It would be easy to imagine a guided experience that might go something like this:</p><blockquote name=\"5492\" id=\"5492\" class=\"graf--blockquote\">Customer: I’d like a pizza delivered right now<br/><strong class=\"markup--strong markup--blockquote-strong\"><em class=\"markup--em markup--blockquote-em\">Dominos: How big? [Small] [Medium] [Large]</em></strong><br/>Customer: *selects Medium*<br/><strong class=\"markup--strong markup--blockquote-strong\"><em class=\"markup--em markup--blockquote-em\">Dominos: What kind of toppings? [Pepperoni] [Sausage] [See More]</em></strong></blockquote><p name=\"7904\" id=\"7904\" class=\"graf--p\">You get the picture…just a series of pointed questions with a series of taps to get where you need to. Dead simple. Understood by all and no need to build a complicated app to get the job done.</p><p name=\"d674\" id=\"d674\" class=\"graf--p\">Eventually the buttons might go beyond just text and include more complex interactions, but simple phrases are probably a good start.</p><h3 name=\"9a7b\" id=\"9a7b\" class=\"graf--h3\">Siri</h3><p name=\"2a58\" id=\"2a58\" class=\"graf--p\">Whether we realize it or not, some of us are already having a conversation with our iPhones: with Siri. So what if developers could plug directly into Siri by way of MessageKit and enable users to just dictate what they want!</p><blockquote name=\"273c\" id=\"273c\" class=\"graf--blockquote\">User: Siri, get me a Lyft<br/><strong class=\"markup--strong markup--blockquote-strong\"><em class=\"markup--em markup--blockquote-em\">Siri: Where would you like to be picked up? [Brings up a map]</em><br/></strong>User: Here<br/><strong class=\"markup--strong markup--blockquote-strong\"><em class=\"markup--em markup--blockquote-em\">Siri: Great! Lyft will let you know when your ride is on its way.</em></strong></blockquote><h3 name=\"d4ca\" id=\"d4ca\" class=\"graf--h3\">Conclusion</h3><p name=\"ebfe\" id=\"ebfe\" class=\"graf--p\">Obviously much of this is blue sky thinking, but to me it just seems inevitable. Why in the world do I need hundreds of apps on my phone just to get some simple things done? Why do each of those apps need a completely unique experience that might hinder my ability to even do what the app intends? Instead, pulling up a conversation and getting something done quickly and efficiently seems like a more delightful experience to me.</p><p name=\"ebe3\" id=\"ebe3\" class=\"graf--p\">I’ve said in a <a href=\"https://medium.com/@mg/the-graphical-user-interface-will-soon-give-way-to-the-rise-of-the-conversational-user-interface-ba8cc52f945b\" data-href=\"https://medium.com/@mg/the-graphical-user-interface-will-soon-give-way-to-the-rise-of-the-conversational-user-interface-ba8cc52f945b\" class=\"markup--anchor markup--p-anchor\">previous post</a> that I believe the folks that inhabit the messaging space and those that embrace the conversational user interface will be big winners in the future — folks like <a href=\"https://developers.facebook.com/blog/post/2015/03/25/introducing-messenger-platform-and-businesses-on-messenger/\" data-href=\"https://developers.facebook.com/blog/post/2015/03/25/introducing-messenger-platform-and-businesses-on-messenger/\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow\">Facebook</a>, <a href=\"https://layer.com\" data-href=\"https://layer.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow\">Layer</a>, <a href=\"http://joinassist.com\" data-href=\"http://joinassist.com\" class=\"markup--anchor markup--p-anchor\" rel=\"nofollow\">Assist</a>*. But the big opportunity here could be Apple enabling an entirely new class of experiences, breaking down barriers and focusing on delight. MessageKit can and should be Apple’s next big platform play.</p><p name=\"fc62\" id=\"fc62\" class=\"graf--p graf--last\"><em class=\"markup--em markup--p-em\">*Of note: I’m an advisor to Assist</em></p></div></div></div></body></html>",
			"url_domain": "medium.com",
			"slug": "2015-06-21-apples-biggest-platform-opportunity-yet-medium",
			"title": "如果所有App都跑在iMessage中",
			"url": "https://medium.com/@mg/there-s-a-chat-for-that-apple-s-biggest-platform-opportunity-yet-19d5b1870857",
			"readable_title": "There’s a chat for that",
			"created_at": 1434822933329,
			"summary": "作者畅想了Apple如果推出MessageKit，允许开发人员在iMessage里添加服务，而用户则不用再安装app，直接用iMessage的聊天界面与各种线上服务对话。聊天界面一统天下",
			"content": "<p>作者畅想了 Apple 如果推出 MessageKit，允许开发人员在 iMessage 里添加服务，而用户则不用再安装 app，直接用 iMessage 的聊天界面与各种线上服务对话。聊天界面一统天下。等一下，这不是微信公众号吗？</p>\r\n<p>从开发人员的角度看，在聊天工具中与线上服务（公众号）对话，就像是在做完形填空，其实也不用什么高超的技术：Uber，我在 ___，我的目的地是 ___。</p>",
			"issue_id": 893
		}],
		"number": 0
	}
}
